{
    "专家模式": {
        "写作": {
            "文字撰写": {
                "IsVisible": true,
                "icon": "edit",
                "UsageDescription": "按照文本撰写要求生成文本。",
                "ChinesePromptTemplate": "您的任务是根据提供的输入信息，进行文本创作。请按照以下步骤进行，并在每一步中标明当前步骤：\n- step1: 梳理文章主题，确保充分理解其核心思想和目标。\n- step2: 精准展开写作，保持内容的高度逻辑性和连贯性。\n\n1. 输入信息：\n    1. 文章类型：\n    {{...}}\n    2. 文章主题：\n    {{...}}\n    3. 文章格式：\n    {{...}}\n    4. 语言风格：\n    {{...}}\n    5. 段落数要求：\n    {{...}}\n    6. 字数要求：\n    {{...}}\n    7. 关键字：\n    {{...}}\n    8. 写作语言：\n    {{...}}\n\n2. 任务要求：\n    - 确保写作内容逻辑清晰，结构严谨。\n    - 完整且准确地满足输入信息的所有规定要求。\n    - 保持文章的整体一致性和专业性，确保主题明晰，用词精确。",
                "EnglishPromptTemplate": "Your task is to create a text based on the provided input information. Follow these steps and mark each step in the process:\n- Step 1: Understand the main theme of the article, ensuring a full grasp of its core idea and objective.\n- Step 2: Develop the writing precisely, maintaining high logical coherence and continuity.\n\n1. Input Information:\n    1. Article Type:\n    {{...}}\n    2. Article Theme:\n    {{...}}\n    3. Article Format:\n    {{...}}\n    4. Language Style:\n    {{...}}\n    5. Paragraph Count Requirement:\n    {{...}}\n    6. Word Count Requirement:\n    {{...}}\n    7. Keywords:\n    {{...}}\n    8. Writing Language:\n    {{...}}\n\n2. Task Requirements:\n    - Ensure clear logical content and rigorous structure.\n    - Completely and accurately fulfill all the specified requirements of the input information.\n    - Maintain overall consistency and professionalism of the article, ensuring clarity of theme and precision in word choice.",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的撰写文章类型（例如：科研文章、项目文档、小说、诗歌、杂文、散文）。",
                        "InputLabel": "文章类型",
                        "InputList": [
                            "科研文章",
                            "项目文档",
                            "小说",
                            "诗歌",
                            "杂文",
                            "散文"
                        ]
                    },
                    {
                        "InputPlaceholder": "请描述您的文章主题，以明确文章的核心内容（例如：环境保护、市场分析、个人旅行经历等）。",
                        "InputLabel": "文章主题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请描述您的文章格式（例如：文章、大纲、邮件、想法、博文）。",
                        "InputLabel": "文章格式",
                        "InputList": [
                            "文章",
                            "大纲",
                            "邮件",
                            "想法",
                            "博文"
                        ]
                    },
                    {
                        "InputPlaceholder": "指定您的文章应采用的语言风格（例如：正式、非正式、学术性、幽默等）。",
                        "InputLabel": "语言风格",
                        "InputList": [
                            "正式",
                            "非正式",
                            "学术性",
                            "幽默"
                        ]
                    },
                    {
                        "InputPlaceholder": "指明文章的段落数，以规划文章结构（例如：5、10等）。",
                        "InputLabel": "段落数",
                        "InputList": [
                            1,
                            2,
                            3,
                            4,
                            5,
                            6,
                            7,
                            8,
                            9,
                            10
                        ]
                    },
                    {
                        "InputPlaceholder": "设定文章的字数，尽量控制在500字以下（例如：100,200,300等）。",
                        "InputLabel": "字数要求",
                        "InputList": [
                            50,
                            100,
                            200,
                            300,
                            400,
                            500
                        ]
                    },
                    {
                        "InputPlaceholder": "列出文章中需包含的关键字（例如：可持续发展、创新技术、社交媒体影响等）。",
                        "InputLabel": "关键字",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "指定您希望用于文本创作的语言（例如：中文、英文等）。",
                        "InputLabel": "写作语言",
                        "InputList": [
                            "中文",
                            "英文"
                        ]
                    }
                ]
            },
            "大纲": {
                "IsVisible": true,
                "icon": "edit_note",
                "UsageDescription": "根据提供的主题或关键字生成包含标题、章节和小节的大纲。输出为Markdown格式。仅提供输出内容。大纲应使用指定语言。",
                "ChinesePromptTemplate": "请使用以下主题或关键词生成包括标题、章节和小节的大纲，并以Markdown格式输出。只给我输出内容，不要其他内容。主题或关键词：\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "Please use the following topics or keywords to generate an outline that includes titles, chapters, and subsections. Output it in Markdown format. Only give me the output and nothing else. Topics or keywords: \n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的主题或关键词（例如：全球变暖、区块链技术、中美贸易）",
                        "InputLabel": "主题关键词",
                        "InputList": null
                    }
                ]
            },
            "扩展长度": {
                "IsVisible": true,
                "icon": "expand",
                "UsageDescription": "根据给定的文本，以保持原有含义的前提下，重写并扩展文本，使其长度至少是原文本的两倍。",
                "ChinesePromptTemplate": "重写并扩展以下用三个引号括起来的文本，使其长度为原本长度{{...}}倍。不改变原文语言风格。避免不必要的繁琐。只需给出输出内容，不需要其他任何内容。不要使用引号括起回应。现在，请根据以上概念重写以下文本。用以下文本的同种语言或方言回应：\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "Rewrite the text delimited by triple quotes, make it {{...}} times its original length. Maintain the original language style. Avoid unnecessary verbosity. Only give me the output and nothing else. Do not wrap responses in quotes. Now, using the concepts above, re-write the following text. Respond in the same language variety or dialect of the following text: \n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入文本扩展倍数。",
                        "InputLabel": "扩展倍数",
                        "InputList": [
                            "2",
                            "3",
                            "4",
                            "5",
                            "10"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入您希望重写和扩展的文本。",
                        "InputLabel": "原始文本",
                        "InputList": null
                    }
                ]
            },
            "压缩长度": {
                "IsVisible": true,
                "icon": "compress",
                "UsageDescription": "用于将提供的文本压缩，同时保持原意不变。只输出结果，不要包含其他内容。",
                "ChinesePromptTemplate": "重写由三个引号括起来的文本，并将其缩减至原文字数的{{...}}倍。保持意思相同。只给我输出结果，别的什么也不要。不要将回应放在引号中。现在，根据上述概念，重写下列文本。用以下文本的同一语言变体或方言回应：\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "Rewrite the text enclosed in three quotation marks and reduce it to {{...}} times its original word count. Keep the meaning the same. Only give me the output and nothing else. Do not wrap responses in quotes. Now, using the concepts above, re-write the following text. Respond in the same language variety or dialect of the following text: \n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入文本压缩倍数。",
                        "InputLabel": "压缩倍数",
                        "InputList": [
                            "0.8",
                            "0.6",
                            "0.4",
                            "0.2",
                            "0.1"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入您希望缩减的文本内容。",
                        "InputLabel": "文本内容",
                        "InputList": null
                    }
                ]
            },
            "文字润色": {
                "IsVisible": true,
                "icon": "brush",
                "UsageDescription": "根据要求提供文本润色服务。",
                "ChinesePromptTemplate": "作为一名经验丰富的文本润色专家，您的任务是根据用户的要求，对提供的文本进行深度编辑和润色。请按照以下步骤进行：\n1. 详细审阅以下信息\n```\n原始文本：\n{{...}}\n润色目的和读者对象：\n{{...}}\n具体润色要求和指导：\n{{...}}\n```\n2. 在润色过程中，请注重以下方面：\n- 仔细检查并改进拼写、语法和语句结构\n- 确保文本风格和语调符合目标读者群体和文本目的\n- 检查并修正事实性错误，确保内容的准确性\n- 对文本进行综合性改善，包括但不限于清晰度、连贯性、逻辑性和说服力\n3. 首先提供具体的修改意见，然后呈现润色后的文本。\n4. 最后，详细阐述润色后文本相比原文的提升之处，包括改进的具体方面及其对于整体质量的影响，同时指出仍需改进的领域。\n请确保最终文本：\n- 严格符合润色目的和读者需求\n- 在结构、内容、风格和准确性方面都有显著提升\n- 明确展示您的专业编辑技能，体现出深度润色和改进的效果",
                "EnglishPromptTemplate": "As an experienced text polishing expert, your task is to deeply edit and polish the provided text according to the user's requirements. Please follow these steps:\n1. Carefully review the following information\n```\nOriginal Text:\n{{...}}\nPolishing Purpose and Target Audience:\n{{...}}\nSpecific Polishing Requirements and Guidance:\n{{...}}\n```\n2. During the polishing process, pay attention to the following aspects:\n- Carefully check and improve spelling, grammar, and sentence structure\n- Ensure the text style and tone match the target audience and purpose of the text\n- Check and correct factual errors to ensure content accuracy\n- Make comprehensive improvements to the text, including but not limited to clarity, coherence, logic, and persuasiveness\n3. First, provide specific editing suggestions, then present the polished text.\n4. Finally, detail how the polished text improves upon the original, including specific areas of improvement and their impact on overall quality, while pointing out areas still needing improvement.\nEnsure the final text:\n- Strictly meets the polishing purpose and audience needs\n- Shows significant improvement in structure, content, style, and accuracy\n- Clearly demonstrates your professional editing skills, reflecting the effects of deep polishing and improvement\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您需要润色的原始文本。",
                        "InputLabel": "原始文本",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述您的润色目标和目标读者（例如：提高学术论文的质量、商业报告的可读性、增强博客帖子的吸引力等）。",
                        "InputLabel": "润色目标",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供具体、详细的润色要求和指导（例如：改善语言风格、校对语法和拼写错误、调整内容结构、关键词优化等）。",
                        "InputLabel": "具体要求",
                        "InputList": null
                    }
                ]
            },
            "续写": {
                "IsVisible": true,
                "icon": "keyboard",
                "UsageDescription": "继续以相同的语言、语调和风格写作，仅输出续写内容。",
                "ChinesePromptTemplate": "\"\"\"\n{{...}}\n\"\"\" \n继续写作，保持文本的语言、语调和风格与开始部分三重引号内的文本一致。仅输出续写的部分，不包含其他内容。不要在回应中使用引号。",
                "EnglishPromptTemplate": "\"\"\"\n{{...}}\n\"\"\" \nContinue writing that begins the text delimited by triple quotes with the same language, tone, and style. Only give me the output of the continuation and nothing else. Do not wrap responses in quotes.",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您要继续写作的文本起始部分（例如：在一个风和日丽的早晨，...）",
                        "InputLabel": "起始文本",
                        "InputList": null
                    }
                ]
            },
            "纠正错误": {
                "IsVisible": true,
                "icon": "spellcheck",
                "UsageDescription": "对文本中的拼写、语法或句法错误进行纠正。且不改变原文的意思或风格。",
                "ChinesePromptTemplate": "纠正三引号（\"\"\"）中文本的拼写、句法或语法错误，不要改善或更改原文的意思或风格。换句话说，仅纠正拼写、句法或语法错误，不要进行改善。使用列表形式列出每个错误。并给出修改后的文本。\n\n如果原文没有错误，只需输出原文即可，无需添加其他内容。不要在响应中使用引号。\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "Correct any spelling, syntax, or grammar mistakes in the text delimited by triple quotes (\"\"\") without making any improvements or changes to the original meaning or style. In other words, only correct spelling, syntax, or grammar mistakes, do not make improvements.\nList each error using a list format. Provide the corrected text.\n\nIf the original text has no mistakes, just output the original text and nothing else. Do not wrap responses in quotes.\n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入需要纠错的文本。",
                        "InputLabel": "纠错文本",
                        "InputList": null
                    }
                ]
            },
            "风格转换": {
                "IsVisible": true,
                "icon": "draw",
                "UsageDescription": "根据用户指定的风格调整给定文本的表述。保持原文的语言和方言不变。",
                "ChinesePromptTemplate": "在不改变语言的情况下，您的任务是根据指定风格重写三引号间的文本。所需风格为：{{...}}。确保输出与文本的语言种类或方言相同，换句话说，不要改变语言，并且只给我输出，不要包括其他内容。不要用引号包裹回应。\n    \"\"\"\n    {{...}}\n    \"\"\"",
                "EnglishPromptTemplate": "Without changing the language, your task is to rewrite the text delimited by triple quotes according to the specified style. The required style is: {{...}}. Ensure output in the same language variety or dialect of the text - in other words don't change the language, and only give me the output and nothing else. Do not wrap responses in quotes.\n    \"\"\"\n    {{...}}\n    \"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您希望的文章风格（例如：学术、随意、幽默）。",
                        "InputLabel": "文章风格",
                        "InputList": [
                            "学术风格。文风应严肃、严谨、朴实且准确。结构清晰合理，推理符合逻辑；语言应规范、简练、朴素，避免夸张或庸俗表达，确保概念和术语的明确性和准确性；表达方式应遵循语法和表达习惯。无拼写、句法或语法错误",
                            "书面风格。通常要求语言表达严谨、规范，用词要准确无误。句子结构应清晰合理，语法正确。这种风格常用于正式文件、学术论文等，要求避免口语化表达和俚语。",
                            "口语风格。更加随意、口头化，常用于日常对话和非正式场合。句子可能更短，允许俚语和口头习惯用语，语法规则可能更宽松。",
                            "商业风格。要求语言清晰、简洁，用于商业信函、营销材料等。通常注重传达信息和吸引受众，避免过多的技术术语，但仍需专业性。",
                            "技术风格。要求准确性和清晰性，通常用于科学、工程、技术领域的文档和报告。语言应避免模糊不清或多义的表达，术语使用准确，结构清晰。",
                            "社交媒体风格。风格通常更加轻松、随意，适用于社交媒体平台如Twitter、Facebook等。句子可能较短，包含表情符号和缩写词，用词更接近口语。",
                            "文学风格。强调文学性和艺术性，通常用于文学作品如小说、诗歌等。语言可以更富有想象力，表达更加丰富，允许修辞和象征的使用。",
                            "幽默风格。注重制造笑声和娱乐性，通常包括滑稽的表达、笑话和夸张的修辞手法。",
                            "简洁风格。追求简洁明了的表达，尽量避免冗长的句子和繁琐的词汇，力求简练和易懂。",
                            "质朴风格。强调朴素、自然和质朴的语言表达，通常用于描述大自然、乡村生活等情景。",
                            "晦涩风格。语言表达复杂而难以理解，通常使用晦涩的词汇、句法结构或引用隐晦的象征。这种风格可能需要读者或听众具备高度的文化和语言背景知识才能理解。",
                            "马尔克斯-魔幻现实主义风格。通常描绘现实与超自然元素的交织，其语言风格融合了奇幻、不寻常和超现实元素，创造出令人着迷的效果。语言丰富而细腻，常常带有超现实的色彩。细腻的笔触不仅增强了故事的真实感，即使在描述最不可思议的情节时也是如此。现实世界与神话、梦境等元素相互渗透，构建出一个充满象征意义和隐喻的世界，从而揭示深邃的哲理性。"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入您需要按照指定风格修改的文本。",
                        "InputLabel": "原始文本",
                        "InputList": null
                    }
                ]
            },
            "添加细节": {
                "IsVisible": true,
                "icon": "text_increase",
                "UsageDescription": "用于增强和改进文本的真实性和详细程度，同时保持原有的语言风格。",
                "ChinesePromptTemplate": "向三引号内的文本添加一些细节，使其更加真实。确保输出与文本的语言种类或方言相同 - 换句话说，不要改变语言，并且只给我输出，不要别的。不要用引号包裹回应。\n    \"\"\"\n    {{...}}\n    \"\"\"",
                "EnglishPromptTemplate": "Add some details to the text delimited by triple quotes to make it more believable. Ensure output in the same language variety or dialect of the text - in other words don't change the language ,and only give me the output and nothing else. Do not wrap responses in quotes.\n    \"\"\"\n    {{...}}\n    \"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请在此输入您希望增强的文本细节（例如：特定事件的背景信息、人物的详细描述、场景的丰富描绘）。",
                        "InputLabel": "文本细节",
                        "InputList": null
                    }
                ]
            },
            "翻译": {
                "IsVisible": true,
                "icon": "translate",
                "UsageDescription": "将文本翻译成指定语言。",
                "ChinesePromptTemplate": "您是一个在语言翻译方面训练有素的AI。我希望您能将三引号之间的文本翻译成{{...}}，确保翻译准确、流畅、忠于原文。要求返回形式为:{{...}}\n请按照要求格式返回。不要在回应中使用引号。\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "You are a highly skilled AI trained in language translation. I would like you to translate the text delimited by triple quotes into {{...}}, ensuring that the translation is accurate, fluent, and faithful to the original.The required format is: {{...}}\nReturn according to the required format. Do not wrap responses in quotes. \n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入目标语言（例如：英语、汉语）。",
                        "InputLabel": "目标语言",
                        "InputList": [
                            "英语",
                            "汉语"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入返回格式（整篇翻译、逐段翻译、逐句翻译）。",
                        "InputLabel": "返回格式",
                        "InputList": [
                            "整篇翻译（将源文本作为一个整体进行翻译，不需要返回源文本）",
                            "逐段翻译（提供源文本和翻译文本的对照。格式为:\n[此处显示源文本段落1]\n[此处显示翻译文本段落1]\n\n[此处显示源文本段落2]\n[此处显示翻译文本段落2]\n\n...）",
                            "逐句翻译（提供源文本和翻译文本的对照。格式为:\n[此处显示源文本句子1]\n[此处显示翻译文本句子1]\n\n[此处显示源文本句子2]\n[此处显示翻译文本句子2]\n\n...）"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入您希望翻译的文本。",
                        "InputLabel": "翻译文本",
                        "InputList": null
                    }
                ]
            },
            "学术论文翻译": {
                "IsVisible": true,
                "icon": "translate",
                "UsageDescription": "将文本翻译成指定语言。",
                "ChinesePromptTemplate": "您是一个在语言翻译方面训练有素的AI。我希望您能将三引号之间的文本翻译成{{...}}，确保翻译精准、流畅、专业、忠于原文，符合高水平学术论文的风格和标准。要求返回形式为:{{...}}\n请按照要求格式返回。不要在回应中使用引号。\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "You are an AI highly trained in language translation. I would like you to translate the text delimited by triple quotes into {{...}}, ensuring the translation is precise, fluent, professional, faithful to the original, and conforms to the style and standards of high-level academic papers. The required format is: {{...}}\nReturn according to the required format. Do not wrap responses in quotes. \n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入目标语言（例如：英语、汉语）。",
                        "InputLabel": "目标语言",
                        "InputList": [
                            "英语",
                            "汉语"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入返回格式（整篇翻译、逐段翻译、逐句翻译）。",
                        "InputLabel": "返回格式",
                        "InputList": [
                            "整篇翻译（将源文本作为一个整体进行翻译，不需要返回源文本）",
                            "逐段翻译（提供源文本和翻译文本的对照。格式为:\n[此处显示源文本段落1]\n[此处显示翻译文本段落1]\n\n[此处显示源文本段落2]\n[此处显示翻译文本段落2]\n\n...）",
                            "逐句翻译（提供源文本和翻译文本的对照。格式为:\n[此处显示源文本句子1]\n[此处显示翻译文本句子1]\n\n[此处显示源文本句子2]\n[此处显示翻译文本句子2]\n\n...）"
                        ]
                    },
                    {
                        "InputPlaceholder": "请输入您希望翻译的文本。",
                        "InputLabel": "翻译文本",
                        "InputList": null
                    }
                ]
            }
        },
        "阅读": {
            "解释": {
                "IsVisible": true,
                "icon": "psychology_alt",
                "UsageDescription": "根据给定的文本，提供清晰、简洁的解释，以便读者更好地理解。",
                "ChinesePromptTemplate": "请提供三引号内文本的详细解释，用清晰简单的语言，以便读者能够更好地理解。\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "Please provide a detailed explanation in clear and simple language of the text within the triple quotes so that readers can have a better understanding.\n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您需要解释的文本（例如：专业术语、复杂句子、难以理解的段落）。",
                        "InputLabel": "文本内容",
                        "InputList": null
                    }
                ]
            },
            "总结": {
                "IsVisible": true,
                "icon": "menu_book",
                "UsageDescription": "阅读并总结文本内容，提供一个简洁、连贯的摘要，帮助理解文本的主要点。",
                "ChinesePromptTemplate": "你是一名在语言理解和总结方面训练有素的高级AI。我希望你阅读由三重引号界定的文本，并将其总结为一个简洁的摘要段落。力求保留最重要的要点，提供一个连贯、易读的总结，帮助人们理解讨论的主要内容，无需阅读整个文本。请避免不必要的细节或偏离主题的内容。只给我输出结果，不要包含其他内容。不要用引号包裹回应。\n\"\"\"\n{{...}}\n\"\"\"",
                "EnglishPromptTemplate": "You are a highly skilled AI trained in language comprehension and summarization. I would like you to read the text delimited by triple quotes and summarize it into a concise abstract paragraph. Aim to retain the most important points, providing a coherent and readable summary that could help a person understand the main points of the discussion without needing to read the entire text. Please avoid unnecessary details or tangential points.Only give me the output and nothing else. Do not wrap responses in quotes.\n\"\"\"\n{{...}}\n\"\"\"",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您要我总结的文本内容（例如：一段新闻报道、科学论文摘要、会议记录）。",
                        "InputLabel": "文本内容",
                        "InputList": null
                    }
                ]
            }
        },
        "常用功能": {
            "设计提示词": {
                "IsVisible": true,
                "icon": "edit_note",
                "UsageDescription": "参照官方提示工程（Prompt Engineering）规范，设计适用于LLM（Large Language Model）的最佳提示词（Prompt）",
                "ChinesePromptTemplate": "您的任务是根据提示词设计原则、任务要求，设计提示词使其能够对GPT-4提问以达到最好的效果。仅只给我提示词，不要其他内容。提示词的语言应与任务要求保持一致。提示词设计原则和任务要求如下：\n\n提示词设计原则：\n    - 指定模型要扮演的专家角色以明确其任务，如'作为[此处填写要求GPT-4扮演的专家角色，与初始提示词中任务要求相符]，您的任务是[要求GPT-4完成的任务]'\n    - 提供尽可能清晰、具体、专业、准确的指示，以表达您希望模型执行的任务。不要将写清晰的提示词与写简短的提示词混淆。\n    - 如任务较复杂，需要多步完成。明确且详细地说明完成任务所需步骤。\n    - 如存在输入信息，使用分隔符清晰标识输入的各部分。\n    - 明确期望的输出格式、确保尽可能清晰、逻辑性强、便于理解。\n    - 如有必要，提供输出示例模版。\n任务要求：\n```\n{{...}}\n```",
                "EnglishPromptTemplate": "Your task is to design a prompt according to the principles of Prompt Engineering and the task requirements, ensuring the prompt enables the best possible questioning of GPT-4. Provide only the prompt, nothing else. The language of the prompt should be consistent with the language used in the Task Requirement. The principles of prompt design and the task requirement are as follows:\n\nPrompt Design Principles:\n    - Specify the expert role the model should play to clarify its task, such as 'As [fill in the export role you require GPT-4 to play, consistent with the task requirements in the initial prompt], your task is [the task you require GPT-4 to complete]'\n    - Provide as clear, specific, professional, and accurate instructions as possible to convey the task you want the model to perform. Do not confuse writing clear prompts with writing brief prompts.\n    - If the task is complex and requires multiple steps, clearly and detailedly state the steps needed to complete the task.\n    - If there is input information, use separators to clearly mark the different parts of the input.\n    - Clearly define the expected output format to ensure clarity, strong logic, and ease of understanding.\n    - If necessary, provide an output example template.\nTask Requirement:\n```\n{{...}}\n```",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入任务要求",
                        "InputLabel": "任务要求",
                        "InputList": null
                    }
                ]
            },
            "优化提示词": {
                "IsVisible": true,
                "icon": "edit_note",
                "UsageDescription": "参照官方提示工程（Prompt Engineering）规范，优化适用于LLM（Large Language Model）的最佳提示词（Prompt）",
                "ChinesePromptTemplate": "您的任务是根据提示词设计原则、修改要求，优化初始提示词使其能够对GPT-4提问以达到最好的效果。仅只给我修改后的提示词，不要其他内容。不要改变初始提示词的语言。提示词设计原则和初始提示词如下：\n\n提示词设计原则：\n    - 指定模型要扮演的专家角色以明确其任务，如'作为[此处填写要求GPT-4扮演的专家角色，与初始提示词中任务要求相符]，您的任务是[要求GPT-4完成的任务]'\n    - 提供尽可能清晰、具体、专业、准确的指示，以表达您希望模型执行的任务。不要将写清晰的提示词与写简短的提示词混淆。\n    - 如任务较复杂，需要多步完成。明确且详细地说明完成任务所需步骤。\n    - 如存在输入信息，使用分隔符清晰标识输入的各部分。\n    - 明确期望的输出格式、确保尽可能清晰、逻辑性强、便于理解。\n    - 如有必要，提供输出示例模版。\n\n初始提示词：\n```\n{{...}}\n```\n修改要求：\n```\n{{...}}\n```",
                "EnglishPromptTemplate": "Your task is to improve the initial prompt according to the principles of prompt design and the modification requirements, so that it can be used to ask GPT-4 for best results. Provide only the modified prompt, nothing else. Do not change the language of the initial prompt. The principles of prompt design and the initial prompt are as follows:\n\nPrompt Design Principles:\n    - Specify the export role the model should play to clarify its task, such as 'As a [export role required for GPT-4 to play, consistent with the task requirements in the initial prompt], your task is to [task for GPT-4 to complete]'\n    - Provide as clear, specific, professional, and accurate instructions as possible to express the task you want the model to perform. Do not confuse writing clear prompts with writing brief prompts.\n    - If the task is complex and requires multiple steps, clearly and detailedly describe the steps needed to complete the task.\n    - If there is input information, use delimiters to clearly mark the different parts of the input.\n    - Clearly define the expected output format, ensuring it is as clear, logical, and easy to understand as possible.\n    - If necessary, provide an example template for the output.\n\nInitial Prompt:\n```\n{{...}}\n```\nModification Requirements:\n```\n{{...}}\n```",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入初始提示词",
                        "InputLabel": "初始提示",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入修改要求",
                        "InputLabel": "修改要求",
                        "InputList": [
                            "使初始提示词中任务描述具体化",
                            "将初始提示词中任务拆解为多个步骤",
                            "改进初始提示词的逻辑和结构，使其更加清晰易懂。但不改变其含义",
                            "指定规范的输出格式"
                        ]
                    }
                ]
            },
            "疾病诊断": {
                "IsVisible": true,
                "icon": "medical_services",
                "UsageDescription": "辅助用户进行初步的疾病诊断，但不能替代专业的治疗意见。",
                "ChinesePromptTemplate": "作为主任医师，您的任务是根据提供的患者信息，通过多轮询问，根据患者的回答做出专业、准确、全面的诊断。当您获得足够的信息或完成5轮询问后，请说明目前所知信息已充足并给出诊断结果、诊断依据、不同病症患病概率以及治疗建议。请尽量避免漏诊和误诊情况以免延误患者治疗。当已知信息不足以给出专业、准确、全面的诊断时，请继续提问以获得有效信息。患者信息如下：\n```\n主要症状：\n{{...}}\n症状时间：\n{{...}}\n当前药物：\n{{...}}\n病史过敏：\n{{...}}\n```\n",
                "EnglishPromptTemplate": "As a Chief Physician, your task is to make a professional, accurate, and comprehensive diagnosis based on the patient information provided, through multiple rounds of questioning and according to the patient's responses. Once you have obtained sufficient information or completed 5 rounds of questioning, please state that the information known so far is sufficient and give a diagnosis, the basis for the diagnosis, the probability of different diseases, and treatment suggestions. Try to avoid missing or misdiagnosing to prevent delaying patient treatment. If the information known is not enough for a professional, accurate, and comprehensive diagnosis, please continue to ask questions to obtain effective information. Patient information is as follows:\n```\nMain symptoms:\n{{...}}\nDuration of symptoms:\n{{...}}\nCurrent medication:\n{{...}}\nMedical history and allergies:\n{{...}}\n```\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的主要症状。",
                        "InputLabel": "主要症状",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述症状开始的时间和持续时间。",
                        "InputLabel": "症状时间",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供您目前正在使用的任何药物或治疗。",
                        "InputLabel": "使用药物",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供您的既往病史，包括任何已知的过敏反应。",
                        "InputLabel": "病史过敏",
                        "InputList": null
                    }
                ]
            },
            "法律咨询": {
                "IsVisible": true,
                "icon": "gavel",
                "UsageDescription": "提供适用于中国的法律咨询服务",
                "ChinesePromptTemplate": "作为法律顾问，您的任务是请根据提供信息，通过多轮对话深入了解案情，运用法律专业知识分析问题，并提供专业、准确、全面的法律意见。请以逻辑严谨的方式回答，并确保您的建议遵循中国法律法规。当您获得足够的信息或完成5轮询问后，请根据所获得的信息给出法律分析、可能适用的法律条文、不同解决方案的可行性与后果，并制定解决问题的方案和后续行动计划。如果现有信息不足以形成一个全面的法律建议，请继续提出询问，直至获得所有必要信息。提供信息如下：\n```\n问题类型（如合同纠纷、房产问题、劳动争议等）：\n{{...}}\n事件详情：\n{{...}}\n相关证据：\n{{...}}\n期望结果：\n{{...}}\n```\n\n\n注意:\n```\n请务必保证依据中国法律法规\n```",
                "EnglishPromptTemplate": "As a legal advisor, your task is to understand the case details through multiple rounds of dialogue based on the provided information, apply your legal expertise to analyze the issues, and provide professional, accurate, and comprehensive legal opinions. Respond in a logically rigorous manner, ensuring that your advice complies with Chinese laws and regulations. Once you have sufficient information or complete 5 rounds of inquiry, provide a legal analysis based on the information obtained, applicable legal provisions, the feasibility and consequences of different solutions, and develop a plan to solve the problem along with subsequent action steps. If the existing information is insufficient to form a comprehensive legal opinion, continue to make inquiries until all necessary information is obtained. The provided information is as follows:\n```\nType of issue (e.g., contract dispute, property issue, labor dispute, etc.):\n{{...}}\nDetails of the incident:\n{{...}}\nRelevant evidence:\n{{...}}\nDesired outcome:\n{{...}}\n```\n\n\nNote:\n```\nPlease ensure to comply with Chinese laws and regulations.\nRespond in Chinese, please.\n```",
                "Inputs": [
                    {
                        "InputPlaceholder": "请详细描述您遇到的法律问题，包括问题的类型（如合同纠纷、房产问题、劳动争议等）。",
                        "InputLabel": "问题类型",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供具体相关事实，如事件发生的时间、地点、涉及的当事人以及已采取的行动或措施。",
                        "InputLabel": "事件详情",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "附上您手头的相关证据或文件，例如合同副本、交易记录、证人证言等（如果适用）。",
                        "InputLabel": "相关证据",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "明确您希望得到的法律帮助，如寻求赔偿、协商解决或法律意见等。",
                        "InputLabel": "帮助目标",
                        "InputList": null
                    }
                ]
            },
            "金融投资": {
                "IsVisible": true,
                "icon": "account_balance",
                "UsageDescription": "提供金融投资咨询服务",
                "ChinesePromptTemplate": "作为金融顾问，您的任务是根据您的专业知识并结合用户提供的信息，通过多轮询问，为用户提出的金融领域相关问题提出专业、准确、全面的金融分析和建议。当您获得足够的信息或完成5轮询问后，请说明目前所知信息已充足并给出您的分析结果和分析依据。请根据中国金融市场环境进行回答。当已知信息不足以给出专业、准确、全面的建议时，请继续提问以获得有效信息。客户提供信息如下：\n```\n投资产品/项目名称：\n{{...}}\n咨询投资问题：\n{{...}}\n预期投资时间范围：\n{{...}}\n当前的财务情况和资产配置情况：\n{{...}}\n风险偏好（保守、中等、积极）：\n{{...}}\n```",
                "EnglishPromptTemplate": "As a financial advisor, your task is to provide professional, accurate, and comprehensive financial analysis and recommendations for questions related to the financial field, based on your expertise and the information provided by the user. Through multiple rounds of inquiries, when you have gathered sufficient information or completed 5 rounds of inquiries, please state that the information at hand is adequate and provide your analysis and the rationale behind it. Respond based on the context of China's financial market environment. Continue asking questions to obtain effective information if the information at hand is insufficient for professional, accurate, and comprehensive advice. The client has provided the following information:\n```\nInvestment product/project name:\n{{...}}\nConsultation investment question:\n{{...}}\nExpected investment time frame:\n{{...}}\nCurrent financial situation and asset allocation:\n{{...}}\nRisk preference (conservative, moderate, aggressive):\n{{...}}\n```\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您要分析的投资产品/项目名称",
                        "InputLabel": "投资产品",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请描述您希望了解的投资问题",
                        "InputLabel": "投资问题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "输入您想要考虑的投资时间范围",
                        "InputLabel": "投资时长",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入您的当前的财务情况和资产配置情况",
                        "InputLabel": "资产配置",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "您对风险的态度是什么（保守、中等、积极）",
                        "InputLabel": "风险偏好",
                        "InputList": null
                    }
                ]
            },
            "沟通策略": {
                "IsVisible": true,
                "icon": "chat",
                "UsageDescription": "针对不同的社交和职业环境，帮助用户制定符合中国文化和语言习惯的沟通和应对策略。",
                "ChinesePromptTemplate": "作为沟通策略专家，你的任务是在不同的社交和职业环境中提供专业、全面、具体的沟通策略和建议。请根据以下步骤操作：\n- 仔细审阅提供的信息\n- 考虑应该遵循的中国社交礼仪、观念习俗和语言习惯\n- 在处理敏感话题时给出婉转而高情商的建议\n- 在职场沟通、公共演讲或团队协作中提供专业的沟通规划\n- 分析可能的对方反应并提供应对策略\n\n提供的信息如下：\n```\n沟通场景：\n{{...}}\n\n沟通目标：\n{{...}}\n\n对方背景信息：\n{{...}}\n\n避免的敏感内容：\n{{...}}\n```",
                "EnglishPromptTemplate": "As a communication strategy expert, your task is to provide professional, comprehensive, and specific communication strategies and advice in various social and professional settings. Please follow these steps:\n- Carefully review the information provided\n- Consider Chinese social etiquette, concepts, customs, and linguistic practices that should be followed\n- Offer tactful and emotionally intelligent advice when dealing with sensitive topics\n- Provide professional communication planning in workplace communication, public speaking, or team collaboration\n- Analyze possible reactions of the other party and provide coping strategies\n\nThe provided information is as follows:\n```\nCommunication Scenario:\n{{...}}\n\nCommunication Goal:\n{{...}}\n\nBackground Information of the Other Party:\n{{...}}\n\nSensitive Content to Avoid:\n{{...}}\n```\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您需要提供帮助的沟通场景（如商务谈判、团队会议等）",
                        "InputLabel": "沟通场景",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "详细说明任何特定的沟通目标或期望的结果（如达成协议、解决冲突等）。",
                        "InputLabel": "沟通目标",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入对方背景身份、期望或态度等。",
                        "InputLabel": "对方背景",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "列出任何需要避免的敏感话题或内容。",
                        "InputLabel": "敏感内容",
                        "InputList": null
                    }
                ]
            },
            "问题检查": {
                "IsVisible": true,
                "icon": "search",
                "UsageDescription": "识别并分析潜在的问题和风险并提出预防或改进建议。适用于工程安全、软件测试、项目风险评估等多种场景。",
                "ChinesePromptTemplate": "作为一名问题检测专家，您需要根据以下场景描述检测可能存在的问题或潜在风险。请细致地审查并回答下列问题：\n```\n场景描述：\n{{...}}\n```\n\n请您分析并回答：\n```\n1. 在所描述的场景中，您能够检测到任何明显或隐蔽的问题吗？\n2. 有哪些潜在的风险因素需要关注？\n3. 如果存在问题，建议采取哪些预防或改进措施？\n```",
                "EnglishPromptTemplate": "As a problem detection expert, you are required to identify potential issues or risks based on the following scenario description. Please review in detail and answer the following questions (Please respond in Chinese):\n```\nScenario description:\n{{...}}\n```\n\nPlease analyze and answer:\n```\n1. Can you detect any obvious or hidden problems in the described scenario?\n2. What are the potential risk factors that need attention?\n3. If problems exist, what preventive or improvement measures would you suggest?\n```",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述您希望检查的场景，包括任何已知的细节和上下文信息",
                        "InputLabel": "详细场景",
                        "InputList": null
                    }
                ]
            }
        },
        "技术与工程": {
            "编程-python-简易结果": {
                "IsVisible": true,
                "icon": "code",
                "UsageDescription": "按照要求编写Python代码。",
                "ChinesePromptTemplate": "作为Python编程专家，您的任务是根据编程需求完成编程任务。要求:\n```\n代码实现专业、规范、逻辑清晰\n遵循PEP8标准及Google Python编程风格指南\n类与类、类与函数、函数与函数之间，以及import语句与函数定义、函数定义与`if __name__ == '__main__':`语句之间应空两行。类中的方法定义或不同逻辑块之间应空一行。\n包含详尽中文注释，如果包含函数，请给出详细的函数注释并使用:param格式进行入参说明\n在最后通过if __name__ == '__main__': 方式给出示例调用代码\n具有良好的变量命名、易维护，遵守选用编程语言的最佳实践和规范。\n```\n\n编程需求：\n```\n{{...}}\n```\n\n其他要求：\n```\n{{...}}\n```",
                "EnglishPromptTemplate": "As a Python programming expert, your task is to complete the programming tasks based on the programming requirements. Requirements:\n\nCode implementation should be professional, standardized, and logically clear\nFollow the PEP8 standard and the Google Python Style Guide\nThere should be two lines of space between classes, between classes and functions, between functions, and between import statements and function definitions, as well as between function definitions and the `if __name__ == '__main__':` statement. Within classes, there should be one line of space between method definitions or different logical blocks.\nInclude detailed Chinese comments. If functions are included, provide detailed function comments and use the :param format for input parameter explanation\nAt the end, provide example invocation code using the `if __name__ == '__main__':` method\nHave good variable naming, be easy to maintain, and adhere to the best practices and standards of the chosen programming language.\n\n\nProgramming requirements:\n\n{{...}}\n\n\nOther requirements:\n\n{{...}}\n",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述您的编程需求",
                        "InputLabel": "需求概述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供任何其他特定要求或指导，如性能参数、内存限制或特定库/框架的使用。",
                        "InputLabel": "其他要求",
                        "InputList": [
                            "运行速度优先",
                            "实现效果优先",
                            "代码可读性优先"
                        ]
                    }
                ]
            },
            "编程-python-详细结果": {
                "IsVisible": true,
                "icon": "code",
                "UsageDescription": "按照要求编写Python代码。",
                "ChinesePromptTemplate": "作为Python编程专家，您的任务是根据编程需求完成编程任务。要求:\n```\n代码实现专业、规范、逻辑清晰\n遵循PEP8标准及Google Python编程风格指南\n类与类、类与函数、函数与函数之间，以及import语句与函数定义、函数定义与`if __name__ == '__main__':`语句之间应空两行。类中的方法定义或不同逻辑块之间应空一行。\n包含详尽中文注释，如果包含函数，请给出详细的函数注释并使用:param格式进行入参说明\n在最后通过if __name__ == '__main__': 方式给出示例调用代码\n具有良好的变量命名、易维护，遵守选用编程语言的最佳实践和规范。\n```\n\n编程需求：\n```\n{{...}}\n```\n\n其他要求：\n```\n{{...}}\n```\n请按以下步骤操作：\n步骤1: 阐述最佳代码实现思路及其他常见实现思路，对比最佳实现思路与其他常见思路的优劣\n步骤2: 按照最佳代码实现思路编写代码。\n步骤3: 完成后，评估以下要素以确保代码质量：\n  - 代码完整性和对需求的满足度\n  - 代码结构的清晰度和逻辑连贯性\n  - 遵守编程规范和风格指南",
                "EnglishPromptTemplate": "As a Python programming expert, your task is to complete the programming task based on the programming requirements. Requirements:\n\nCode implementation should be professional, standardized, and logically clear\nFollow the PEP8 standard and the Google Python Style Guide\nThere should be two lines of space between classes, between classes and functions, between functions, and between import statements and function definitions, as well as between function definitions and the `if __name__ == '__main__':` statement. Within classes, there should be one line of space between method definitions or different logical blocks.\nInclude detailed Chinese comments. If functions are included, provide detailed function comments and use the :param format for explaining input parameters\nAt the end, provide example invocation code using the `if __name__ == '__main__':` method\nHave good variable naming, be easy to maintain, and adhere to the best practices and standards of the chosen programming language.\n\n\nProgramming requirements:\n\n{{...}}\n\n\nOther requirements:\n\n{{...}}\n\nPlease follow these steps:\nStep 1: Describe the best code implementation approach and other common approaches, comparing the advantages and disadvantages of the best approach against others\nStep 2: Write the code following the best code implementation approach.\nStep 3: Upon completion, assess the following elements to ensure code quality:\n - Completeness of the code and its fulfillment of the requirements\n - Clarity of the code structure and its logical coherence\n - Adherence to programming conventions and style guides",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述您的编程需求",
                        "InputLabel": "需求概述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供任何其他特定要求或指导，如性能参数、内存限制或特定库/框架的使用。",
                        "InputLabel": "其他要求",
                        "InputList": [
                            "运行速度优先",
                            "实现效果优先",
                            "代码可读性优先"
                        ]
                    }
                ]
            },
            "编程-通用编程语言": {
                "IsVisible": true,
                "icon": "code",
                "UsageDescription": "按照要求编写代码。",
                "ChinesePromptTemplate": "作为编程专家，您的任务是按照用户指定的编程语言完成编程任务，以解决用户的编程需求。要求代码实现规范、简洁、明确、高效、逻辑清晰、包含详尽中文注释、具有良好的命名和组织、易维护，遵守选用编程语言的最佳实践和规范。\n\n用户编程需求和指定编程语言如下：\n指定编程语言：\n```\n{{...}}\n```\n\n编程需求：\n```\n{{...}}\n```\n\n其他要求：\n```\n{{...}}\n```\n请按以下步骤操作：\n步骤1: 阐述最佳代码实现思路及其他常见实现思路，对比最佳实现思路与其他常见思路的优劣\n步骤2: 按照最佳代码实现思路编写代码。\n步骤3: 完成后，评估以下要素以确保代码质量：\n  - 代码完整性和对需求的满足度\n  - 代码结构的清晰度和逻辑连贯性\n  - 遵守编程规范和风格指南",
                "EnglishPromptTemplate": "As a programming expert, your task is to complete programming assignments using the programming language specified by the user, to meet their programming needs. The code should be standard, concise, clear, efficient, logically coherent, include comprehensive English comments, have good naming and organization, be easy to maintain, and adhere to the best practices and standards of the chosen programming language.\n\nUser's programming requirements and specified programming language are as follows:\nSpecified programming language:\n```\n{{...}}\n```\n\nProgramming requirement:\n```\n{{...}}\n```\n\nOther requirements:\n```\n{{...}}\n```\nPlease proceed with the following steps:\nStep 1: Elucidate the best code implementation approach and other common approaches, comparing the advantages and disadvantages of the best approach with others.\nStep 2: Write code according to the best code implementation approach.\nStep 3: Upon completion, assess the following aspects to ensure code quality:\n  - Completeness of the code and its adequacy in meeting the requirements\n  - Clarity of code structure and logical coherence\n  - Adherence to coding standards and style guides",
                "Inputs": [
                    {
                        "InputPlaceholder": "指定您希望使用的编程语言（如 Python、JavaScript、C++等）。",
                        "InputLabel": "编程语言",
                        "InputList": [
                            "Python",
                            "JavaScript",
                            "C++"
                        ]
                    },
                    {
                        "InputPlaceholder": "详细描述您的编程需求",
                        "InputLabel": "需求概述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供任何其他特定要求或指导，如性能参数、内存限制或特定库/框架的使用。",
                        "InputLabel": "其他要求",
                        "InputList": [
                            "运行速度优先",
                            "实现效果优先",
                            "代码可读性优先"
                        ]
                    }
                ]
            },
            "算法设计": {
                "IsVisible": true,
                "icon": "functions",
                "UsageDescription": "根据特定需求提供算法解决方案或性能分析。",
                "ChinesePromptTemplate": "作为一名专业的算法工程师，你的任务是根据用户提供的详细信息进行专业、全面、具体、有逻辑性的算法设计与性能分析。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n算法需求：\n{{...}}\n详细功能描述：\n{{...}}\n额外要求和指导：\n{{...}}\n```\n根据以上信息，开始你的算法设计或性能分析工作。请确保最终输出：\n- 紧密围绕算法需求和功能描述展开\n- 详细且逻辑清晰地反映所有的额外要求和指导\n- 完成设计后，请检查并确认以下内容是否满足要求：\n  - 算法是否满足所有功能需求\n  - 性能分析是否全面、逻辑性是否强\n  - 解决方案是否适用于特定问题场景",
                "EnglishPromptTemplate": "As a professional algorithm engineer, your task is to conduct professional, comprehensive, specific, and logical algorithm design and performance analysis based on the detailed information provided by the user. Please follow these steps: \nCarefully review the following information\n```\nAlgorithm Requirements:\n{{...}}\nDetailed Function Description:\n{{...}}\nAdditional Requirements and Guidance:\n{{...}}\n```\nBased on the above information, begin your work on algorithm design or performance analysis. Ensure the final output: \n- Closely revolves around the algorithm requirements and function description\n- Details and logically reflects all the additional requirements and guidance\n- After completing the design, check and confirm whether the following requirements are met:\n  - Whether the algorithm meets all functional requirements\n  - Whether the performance analysis is comprehensive and logical\n  - Whether the solution is applicable to specific problem scenarios\n[Please respond in Chinese]",
                "Inputs": [
                    {
                        "InputPlaceholder": "描述您的算法需求（例如：数据分析、机器学习模型、图像处理等）。",
                        "InputLabel": "算法需求",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "详细说明功能需求，包括具体目标、预期结果、性能指标等。",
                        "InputLabel": "功能描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供额外要求和指导，如特定算法限制、资源约束、截止日期等。",
                        "InputLabel": "额外要求",
                        "InputList": null
                    }
                ]
            },
            "科研": {
                "IsVisible": true,
                "icon": "science",
                "UsageDescription": "提供专业建议，协助完成研究方法、文献查阅、实验设计等任务。",
                "ChinesePromptTemplate": "作为一名专业的研究咨询专家，你的任务是根据用户提供的详细信息进行专业、全面、具体、有逻辑性的研究咨询服务。请根据以下步骤操作：\n请仔细审阅以下信息\n研究问题：\n{{...}}\n研究领域：\n{{...}}\n具体需求：\n{{...}}\n根据以上信息，开始你的咨询服务。请确保最终建议：\n- 紧密围绕咨询问题、领域和需求展开\n- 详细且逻辑清晰地提供专业建议\n- 完成咨询后，请检查并确认以下内容是否满足要求：\n  - 是否针对性强、有助于解决问题\n  - 建议是否清晰、逻辑性强\n  - 语言风格是否专业且适合客户需求",
                "EnglishPromptTemplate": "As a professional research consultant, your task is to provide expert, comprehensive, specific, and logical research consulting services based on the detailed information provided by the user. Please follow these steps:\nCarefully review the following information\nResearch Question:\n{{...}}\nResearch Area:\n{{...}}\nSpecific Requirements:\n{{...}}\nBased on the above information, begin your consulting service. Ensure that the final advice:\n- Closely revolves around the consultation question, area, and requirements\n- Provides detailed and logically clear professional advice\n- After completing the consultation, check and confirm if the following requirements are met:\n  - Whether it is targeted and helpful in solving the problem\n  - Whether the advice is clear and logical\n  - Whether the language style is professional and suitable for customer needs\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的具体研究问题（例如：如何设计有效的实验来测试某种假设？）。",
                        "InputLabel": "研究问题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述您的研究领域或主题（例如：生物医学、环境科学、计算机科学等）。",
                        "InputLabel": "研究领域",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供您需要的具体咨询类型（例如：实验设计、数据分析、文献综述、科研伦理等）。",
                        "InputLabel": "具体需求",
                        "InputList": null
                    }
                ]
            },
            "技术指导": {
                "IsVisible": true,
                "icon": "support_agent",
                "UsageDescription": "为各领域的技术问题提供专业解决方案和指导。",
                "ChinesePromptTemplate": "作为一名跨领域的技术咨询专家，你的任务是根据用户提出的问题、背景信息和具体需求，提供专业、全面、有逻辑性的技术解决方案和指导。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n问题概述：\n{{...}}\n问题背景：\n{{...}}\n需求与目标：\n{{...}}\n```\n根据以上信息，开始你的技术解决方案制定和指导工作。请确保最终方案：\n- 全面理解和解答问题，考虑到问题背景\n- 明确且逻辑清晰地达成需求与目标\n- 完成方案制定后，请检查并确认以下内容是否满足要求：\n  - 是否全面解决了提出的问题\n  - 方案是否切实可行，逻辑性是否强\n  - 是否适合目标用户的技术水平和实际应用",
                "EnglishPromptTemplate": "As a cross-disciplinary technical consulting expert, your task is to provide professional, comprehensive, and logical technical solutions and guidance based on the user's presented problem, background information, and specific needs. Please follow these steps: \nCarefully review the following information\n```\nProblem Overview:\n{{...}}\nProblem Background:\n{{...}}\nNeeds and Objectives:\n{{...}}\n```\nBased on the above information, begin your work of formulating and guiding the technical solution. Ensure the final plan: \n- Fully understands and addresses the question, considering the problem's background\n- Clearly and logically achieves the needs and objectives\n- After completing the plan formulation, check and confirm whether the following requirements are met:\n  - Whether the presented problem is fully solved\n  - Whether the plan is feasible and logical\n  - Whether it is suitable for the target user's technical level and practical application\n[Please respond in Chinese]",
                "Inputs": [
                    {
                        "InputPlaceholder": "概述您遇到的技术问题（例如：系统故障、工艺改进、产品设计等）。",
                        "InputLabel": "问题概述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供问题发生的背景信息（例如：使用环境、已有技术、相关资源等）。",
                        "InputLabel": "问题背景",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "阐述您的需求和目标（例如：解决问题的紧迫性、预期效果、资源限制等）。",
                        "InputLabel": "需求与目标",
                        "InputList": null
                    }
                ]
            },
            "备课": {
                "IsVisible": true,
                "icon": "menu_book",
                "UsageDescription": "为教师提供关于教学PPT内容精选与结构化布局的专业建议。",
                "ChinesePromptTemplate": "作为一名教学内容策划专家，您的任务是基于教师提供的详细信息，提供专业、细致、有条理的教学PPT内容策划建议。请依照以下步骤操作：\n仔细阅读以下信息\n课程内容与教学目标：\n{{...}}\n目标学生群体：\n{{...}}\nPPT内容结构化需求：\n{{...}}\n根据以上信息，展开您的内容策划工作。请确保最终PPT内容：\n- 紧扣课程内容与教学目标\n- 易于学生理解，符合目标学生群体的特点\n- 在完成内容策划后，请检查并确认：\n  - 内容是否全面、逻辑性强\n  - 是否利于提升教学效果及学生的参与度\n  - 信息是否准确，及时反映最新教学理念和资料",
                "EnglishPromptTemplate": "As an educational content planning expert, your task is to provide professional, detailed, and well-organized teaching PPT content planning suggestions based on the detailed information provided by the teacher. Please follow these steps:\nCarefully read the following information\nCourse Content and Teaching Objectives:\n{{...}}\nTarget Student Group:\n{{...}}\nPPT Content Structuring Needs:\n{{...}}\nBased on the above information, proceed with your content planning work. Ensure that the final PPT content:\n- Closely aligns with the course content and teaching objectives\n- Is easy for students to understand and suits the characteristics of the target student group\n- After completing the content planning, check and confirm:\n  - Whether the content is comprehensive and logically strong\n  - Whether it helps to enhance teaching effectiveness and student engagement\n  - Whether the information is accurate, reflecting the latest teaching concepts and materials\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请概述您将要授课的课程内容及教学目标（如：管理学原理、市场营销案例分析等）。",
                        "InputLabel": "课程内容",
                        "InputList": [
                            "工商管理"
                        ]
                    },
                    {
                        "InputPlaceholder": "描述您的目标学生群体（如：大学本科生、MBA学员、具有不同学术背景的学生等）。",
                        "InputLabel": "目标学生",
                        "InputList": [
                            "大学本科生",
                            "硕士研究生",
                            "MBA学员"
                        ]
                    },
                    {
                        "InputPlaceholder": "提出您在PPT内容结构化方面的具体需求（如：理论框架阐述、实践案例展示、互动讨论环节设计等）。",
                        "InputLabel": "具体需求",
                        "InputList": [
                            "理论框架阐述",
                            "实践案例展示",
                            "互动讨论环节设计"
                        ]
                    }
                ]
            }
        },
        "商业与管理": {
            "项目管理": {
                "IsVisible": true,
                "icon": "assignment_turned_in",
                "UsageDescription": "提供针对项目管理挑战的专业解决方案。",
                "ChinesePromptTemplate": "作为一个经验丰富的项目经理，你的任务是根据提供的信息给出专业、全面、明确、可操作性的解决方案。请根据以下步骤操作：\n请仔细审阅以下信息\n\n项目问题或需求：\n{{...}}\n项目挑战详细信息：\n{{...}}\n项目相关参数或条件：\n{{...}}\n\n根据以上信息，开始你的解决方案规划。请确保最终方案：\n- 针对项目问题或需求提供明确的解决方法\n- 考虑到项目挑战的详细信息，提出切实可行的措施\n- 在给定的项目参数或条件下，确保方案的可操作性\n完成方案规划后，请检查并确认以下内容是否满足要求：\n  - 方案是否针对性强，能有效解决项目问题\n  - 方案是否详尽、逻辑清晰\n  - 是否考虑了项目的全部相关因素和约束条件",
                "EnglishPromptTemplate": "As an experienced project manager, your task is to provide professional, comprehensive, clear, and actionable solutions based on the provided information. Please follow these steps:\nCarefully review the following information\n\nProject Issue or Requirement:\n{{...}}\nDetailed Information on Project Challenges:\n{{...}}\nProject Related Parameters or Conditions:\n{{...}}\n\nBased on the above information, start planning your solution. Ensure that the final plan:\n- Offers a clear solution method for the project issue or requirement\n- Considers the detailed information on project challenges to propose practical measures\n- Ensures the operability of the solution within the given project parameters or conditions\nAfter completing the solution planning, check and confirm if the following requirements are met:\n  - Whether the solution is targeted and effectively solves the project issue\n  - Whether the solution is thorough and logically clear\n  - Whether all relevant factors and constraints of the project have been considered\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请描述项目面临的具体问题或需求（例如：成本控制、时间管理、团队协作问题等）。",
                        "InputLabel": "问题或需求",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "详细描述项目面临的挑战（例如：资源限制、技术难题、市场变化等）。",
                        "InputLabel": "挑战详细信息",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述项目相关的参数或条件（例如：预算限制、时间框架、团队能力、资源可用性等）。",
                        "InputLabel": "参数或条件",
                        "InputList": null
                    }
                ]
            },
            "产品开发": {
                "IsVisible": true,
                "icon": "engineering",
                "UsageDescription": "根据用户需求提供产品设计、市场定位、功能优化的策略性建议。",
                "ChinesePromptTemplate": "作为一名专业的策略顾问，你的任务是根据用户提供的详细信息进行深入分析，提出专业、具体、切实可行的策略建议。请根据以下步骤操作：\n请仔细审阅以下信息\n问题或场景描述：\n{{...}}\n目标客户群体：\n{{...}}\n期望成果和关键指标：\n{{...}}\n根据以上信息，开始你的分析或建议工作。请确保最终策略建议：\n- 紧密围绕问题或场景进行深入分析\n- 针对目标客户群体制定策略\n- 明确期望成果和关键指标，确保建议具体可行\n- 完成分析后，请检查并确认以下内容是否满足要求：\n  - 是否针对性强，解决了提出的问题或需求\n  - 建议是否具有可操作性和实际应用价值\n  - 语言风格和内容是否适合目标读者",
                "EnglishPromptTemplate": "As a professional strategy consultant, your task is to conduct in-depth analysis and provide professional, specific, and practical strategic advice based on the detailed information provided by the user. Please follow these steps:\nCarefully review the following information\nProblem or Scenario Description:\n{{...}}\nTarget Customer Group:\n{{...}}\nExpected Outcomes and Key Indicators:\n{{...}}\nBased on the above information, start your analysis or advisory work. Ensure that the final strategic recommendation:\n- Involves an in-depth analysis closely revolving around the problem or scenario\n- Develops strategies tailored for the target customer group\n- Clearly defines expected outcomes and key indicators, ensuring that the recommendations are practical and feasible\n- After completing the analysis, check and confirm if the following requirements are met:\n  - Whether it is targeted and resolves the presented problem or need\n  - Whether the advice is actionable and has practical application value\n  - Whether the language style and content are suitable for the target audience\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述您需要分析或解决的问题、场景或具体需求（例如：产品功能优化、市场定位、用户体验提升等）。",
                        "InputLabel": "问题或场景描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述目标客户群体的特征和需求（例如：年龄段、地域、购买力、喜好等）。",
                        "InputLabel": "目标客户群体",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "阐述您期望的成果和关键绩效指标（例如：市场占有率提升、用户满意度增加、营收增长等）。",
                        "InputLabel": "期望成果和关键指标",
                        "InputList": null
                    }
                ]
            },
            "人员管理": {
                "IsVisible": true,
                "icon": "people",
                "UsageDescription": "提供专业的团队管理和领导力相关建议。",
                "ChinesePromptTemplate": "作为一名资深管理顾问，你的任务是针对管理人员的角色和责任，提供专业、全面的建议和解决方案。请根据以下信息进行分析：\n请仔细审阅以下信息\n```\n问题描述：\n{{...}}\n情境背景：\n{{...}}\n人员信息：\n{{...}}\n```\n根据以上信息，提出你的建议或解决方案。请确保你的建议：\n- 深入理解管理人员的职责和所面临的挑战\n- 具体且实用，适应管理人员的具体需求和情境\n- 完成建议后，请检查并确认以下内容是否满足要求：\n  - 建议是否切实可行，具有实际操作性\n  - 是否全面考虑了所有相关因素和可能的影响",
                "EnglishPromptTemplate": "As a senior management consultant, your task is to provide professional, comprehensive advice and solutions tailored to the roles and responsibilities of management personnel. Please analyze based on the following information:\nCarefully review the following information\n```\nProblem Description:\n{{...}}\nSituational Background:\n{{...}}\nPersonnel Information:\n{{...}}\n```\nBased on the above information, propose your advice or solution. Ensure that your recommendation:\n- Deeply understands the duties and challenges faced by management personnel\n- Is specific and practical, suited to the specific needs and situation of the management staff\n- After completing the recommendation, check and confirm if the following requirements are met:\n  - Whether the advice is practical and operationally viable\n  - Whether all related factors and potential impacts have been comprehensively considered\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "简述您遇到的关于管理人员的问题或挑战。",
                        "InputLabel": "问题描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供问题发生的具体背景信息。",
                        "InputLabel": "情境背景",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述涉及的管理人员的职位、角色等信息及被管理人员职务、角色等信息。",
                        "InputLabel": "人员信息",
                        "InputList": null
                    }
                ]
            },
            "目标规划": {
                "IsVisible": true,
                "icon": "flag",
                "UsageDescription": "提供目标设定、战略规划和行动指导。",
                "ChinesePromptTemplate": "作为一名战略规划专家，您的任务是基于综合信息，为个人或组织设定目标、制定战略及规划行动。请详细评估以下信息：\n```\n现状描述：\n{{...}}\n目标设定：\n{{...}}\n资源和约束条件：\n{{...}}\n```\n随后，请执行以下步骤：\n1. 从现状分析出发，细化并明确目标。\n2. 基于这些目标，规划相应的战略和具体行动步骤。\n3. 制定详细的行动计划，包括关键阶段和预期成果。\n确保您的规划：\n- 紧密结合所提供信息，具有高度针对性\n- 创新与实用并重\n- 结构清晰，方便执行和跟踪\n- 充分考虑潜在挑战及应对策略",
                "EnglishPromptTemplate": "As a strategic planning expert, your task is to set goals, develop strategies, and plan actions for individuals or organizations based on comprehensive information. Please assess the following information in detail:\n```\nCurrent Situation Description:\n{{...}}\nGoal Setting:\n{{...}}\nResources and Constraints:\n{{...}}\n```\nSubsequently, please follow these steps:\n1. Start with an analysis of the current situation to refine and clarify goals.\n2. Based on these goals, plan corresponding strategies and specific action steps.\n3. Develop a detailed action plan, including key stages and expected outcomes.\nEnsure that your planning:\n- Is closely linked to the provided information, with high specificity\n- Balances innovation with practicality\n- Has a clear structure, facilitating execution and tracking\n- Fully considers potential challenges and coping strategies\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述当前的情况，包括现状、优势、挑战和改进点。",
                        "InputLabel": "现状描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "明确阐述短期和长期目标。",
                        "InputLabel": "目标设定",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "列出可利用的资源、存在的限制和潜在风险。",
                        "InputLabel": "资源限制",
                        "InputList": null
                    }
                ]
            },
            "广告营销": {
                "IsVisible": true,
                "icon": "campaign",
                "UsageDescription": "提供针对性的广告营销策略与实践建议，支持品牌增长和市场拓展。",
                "ChinesePromptTemplate": "作为广告营销领域的专业顾问，您的任务是基于丰富的行业知识和实践经验，为用户提供具体、创新且可操作的广告营销解决方案。请遵循以下步骤：\n审阅以下信息：\n市场挑战与机遇：\n{{...}}\n目标客户群和消费者画像：\n{{...}}\n战略目标与具体要求：\n{{...}}\n依据这些信息，制定您的策略建议。请确保您的建议：\n- 紧密结合市场动态和目标客户的特点\n- 全面考虑品牌定位、竞争策略和资源配置\n- 在规划完成后，确认方案：\n  - 符合当前市场趋势和竞争环境\n  - 创新性强且具备可行性\n  - 明确执行步骤和预期成效评估",
                "EnglishPromptTemplate": "As a professional consultant in the field of advertising and marketing, your task is to provide specific, innovative, and actionable advertising and marketing solutions based on rich industry knowledge and practical experience. Please follow these steps:\nReview the following information:\nMarket Challenges and Opportunities:\n{{...}}\nTarget Customer Group and Consumer Profiles:\n{{...}}\nStrategic Goals and Specific Requirements:\n{{...}}\nBased on this information, formulate your strategic recommendations. Ensure that your recommendations:\n- Closely integrate with market dynamics and the characteristics of the target customers\n- Comprehensively consider brand positioning, competitive strategy, and resource allocation\n- After planning, confirm that the solution:\n  - Aligns with current market trends and competitive environment\n  - Is highly innovative and feasible\n  - Has clear execution steps and anticipated performance assessments\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "概述您面临的广告营销挑战或把握的市场机会（如目标市场渗透、竞品分析、广告优化等）。",
                        "InputLabel": "市场挑战与机遇",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述目标客户群体和消费者特征（如年龄、消费习惯、媒体偏好等）。",
                        "InputLabel": "客户群与消费者画像",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "阐述您的战略目标和具体需求（如品牌重塑、市场份额扩增、销售提升等）。",
                        "InputLabel": "战略目标与要求",
                        "InputList": null
                    }
                ]
            }
        },
        "信息处理": {
            "信息整理": {
                "IsVisible": true,
                "icon": "view_list",
                "UsageDescription": "提供针对复杂数据和信息的专业整理和分析。",
                "ChinesePromptTemplate": "作为一名数据与信息管理专家，您的任务是对所提供的复杂数据和信息进行专业的分析、归纳和整理。请遵循以下步骤：\n1. 详细审阅提供的信息：\n   - 信息内容：\n     {{...}}\n   - 整理和分析要求：\n     {{...}}\n2. 基于所给信息执行整理和分析任务。确保结果：\n   - 精确展现所提供信息的要点\n   - 严格遵循整理和分析的指定要求\n   - 结构清晰、逻辑连贯\n在完成后，进行以下确认：\n   - 全面覆盖所提信息内容\n   - 结果格式和质量符合专业标准\n   - 适应预定的应用场景或目标受众",
                "EnglishPromptTemplate": "As a data and information management expert, your task is to professionally analyze, summarize, and organize the complex data and information provided. Please follow these steps:\n1. Thoroughly review the provided information:\n   - Information Content:\n     {{...}}\n   - Organization and Analysis Requirements:\n     {{...}}\n2. Based on the given information, execute the organization and analysis tasks. Ensure the results:\n   - Accurately present the key points of the provided information\n   - Strictly adhere to the specified requirements for organization and analysis\n   - Are clear in structure and coherent in logic\nAfter completion, confirm the following:\n   - Comprehensive coverage of the provided information content\n   - The format and quality of results meet professional standards\n   - Suitable for the intended application scenario or target audience\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "输入待整理和分析的信息内容（例如：市场数据、科研结果、业务报告等）。",
                        "InputLabel": "信息内容",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "具体描述整理和分析的要求及目的（例如：决策支持、学术研究、业务优化等）。",
                        "InputLabel": "要求与目的",
                        "InputList": null
                    }
                ]
            },
            "维基百科格式生成": {
                "IsVisible": true,
                "icon": "wysiwyg",
                "UsageDescription": "转换文本格式以符合维基百科的标准。",
                "ChinesePromptTemplate": "作为维基百科格式化专家，您的任务是将提供的文本内容转化为符合维基百科标准的格式。请遵循以下步骤：\n审阅以下信息：\n```\n待转化文本：\n{{...}}\n文本主题：\n{{...}}\n```\n在此基础上，进行以下操作：\n- 将待转化文本调整为遵守维基百科格式和风格指南\n- 确保内容客观准确且中立\n- 在文本中适当使用内部链接\n- 添加必要的可靠参考文献\n- 使用清晰、标准和中性的语言\n- 确保文章结构清晰，逻辑性强",
                "EnglishPromptTemplate": "As a Wikipedia formatting expert, your task is to transform the provided text content into a format that conforms to Wikipedia standards. Please follow these steps:\nReview the following information:\n```\nText to be Transformed:\n{{...}}\nText Theme:\n{{...}}\n```\nBased on this, perform the following operations:\n- Adjust the text to be transformed to adhere to Wikipedia's formatting and style guidelines\n- Ensure the content is objective, accurate, and neutral\n- Appropriately use internal links within the text\n- Add necessary and reliable references\n- Use clear, standard, and neutral language\n- Ensure the article structure is clear and logically strong\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入需要转化为维基百科格式的文本内容。",
                        "InputLabel": "待转化文本",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "简述文本的主要主题或领域。",
                        "InputLabel": "文本主题",
                        "InputList": null
                    }
                ]
            }
        },
        "分析与理论": {
            "理论分析": {
                "IsVisible": true,
                "icon": "analytics",
                "UsageDescription": "提供基于理论和实例的专业论证服务。包括：1. 对特定场景进行客观且中立的理论分析；2. 从理论和实例出发，论证正方观点或行为的合理性；3. 利用理论和实际例证，论证反方观点或行为的不合理性。",
                "ChinesePromptTemplate": "作为一名理论专家，请依次进行如下任务：\n1. 对所提供的场景进行客观、中立且逻辑严密的理论分析。指出所有合理和不合理之处\n2. 结合理论依据和实例，尽力论证正方观点或行为的合理性。\n3. 使用理论分析和实例，尽力论证反方观点或行为的不合理性。\n在执行任务前，请细致审阅以下信息：\n```\n场景描述：\n{{...}}\n正方观点或行为：\n{{...}}\n反方观点或行为：\n{{...}}\n相关材料：\n{{...}}\n```\n在完成任务时，请确保您的论证：\n- 在理论层面上专业、科学且具有说服力\n- 实例清楚、普适且易于理解\n- 结构逻辑清晰，论证全面\n- 严格符合所提供信息的要求",
                "EnglishPromptTemplate": "As a theory expert, please perform the following tasks in order:\n1. Conduct an objective, neutral, and logically rigorous theoretical analysis of the provided scenario. Point out all reasonable and unreasonable aspects.\n2. Combine theoretical basis and examples to vigorously argue for the reasonableness of the proponent's viewpoint or behavior.\n3. Use theoretical analysis and examples to vigorously argue against the reasonableness of the opponent's viewpoint or behavior.\nBefore executing the tasks, please thoroughly review the following information:\n```\nScenario Description:\n{{...}}\nProponent's Viewpoint or Behavior:\n{{...}}\nOpponent's Viewpoint or Behavior:\n{{...}}\nRelevant Materials:\n{{...}}\n```\nWhen completing the tasks, ensure that your argumentation:\n- Is professional, scientific, and persuasive at the theoretical level\n- Uses clear, universally applicable, and easy-to-understand examples\n- Is structurally logical and comprehensive in argumentation\n- Strictly conforms to the requirements of the provided information\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "详细描述您所需分析论证的场景。",
                        "InputLabel": "场景描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "阐述您将支持的正方观点或行为。",
                        "InputLabel": "正方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "说明您将驳斥的反方观点或行为。",
                        "InputLabel": "反方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供相关的数据、研究或其他辅助材料。",
                        "InputLabel": "相关材料",
                        "InputList": null
                    }
                ]
            },
            "哲学分析": {
                "IsVisible": true,
                "icon": "question_mark",
                "UsageDescription": "提供哲学层面的分析论证。包括：对特定场景的哲学解读，对正反双方观点的哲学支持与批判分析，并通过具体案例来增强理论的实际应用性和理解力。",
                "ChinesePromptTemplate": "作为哲学领域的专家，请按以下步骤进行：\n1. 对所提供场景进行全面的哲学解析，考虑不同哲学流派和理论的适用性。\n2. 依据哲学理论，提出对正方观点的支持性分析，同时结合实际案例加强观点的现实关联性。\n3. 基于哲学理论，进行对反方观点的批判性分析，利用案例进一步论证其不合理之处。\n开始前，请仔细审视以下信息：\n```\n场景描述：\n{{...}}\n正方观点：\n{{...}}\n反方观点：\n{{...}}\n参考理论和案例：\n{{...}}\n```\n确保您的分析和论证过程符合哲学思维的严密性，逻辑连贯，同时在理论与实践之间架起桥梁。",
                "EnglishPromptTemplate": "As an expert in the field of philosophy, please proceed with the following steps:\n1. Conduct a comprehensive philosophical analysis of the provided scenario, considering the applicability of different philosophical schools and theories.\n2. Based on philosophical theories, provide a supportive analysis of the proponent's viewpoint, while also using actual cases to strengthen the real-world relevance of the viewpoint.\n3. Perform a critical analysis of the opponent's viewpoint based on philosophical theories, using cases to further argue its irrational aspects.\nBefore beginning, please carefully review the following information:\n```\nScenario Description:\n{{...}}\nProponent's Viewpoint:\n{{...}}\nOpponent's Viewpoint:\n{{...}}\nReference Theories and Cases:\n{{...}}\n```\nEnsure that your analysis and argumentation process is rigorous in philosophical thinking, logically coherent, and bridges theory and practice.\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请详细描述待分析的场景，包括其背景和关键要素。",
                        "InputLabel": "场景描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入需要论证的观点。",
                        "InputLabel": "正方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入需要驳斥的观点。",
                        "InputLabel": "反方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供与讨论相关的哲学理论、案例研究或其他辅助材料，以支撑您的分析。",
                        "InputLabel": "相关材料",
                        "InputList": null
                    }
                ]
            },
            "逻辑分析": {
                "IsVisible": true,
                "icon": "device_hub",
                "UsageDescription": "提供逻辑论证分析服务。包括对指定场景的逻辑评价，对特定观点进行逻辑支持或反驳。",
                "ChinesePromptTemplate": "请根据逻辑论证专家的角色，完成以下任务：\n1. 对提供的场景进行细致且系统的逻辑分析，识别逻辑上的合理性与不足。\n2. 以逻辑论证的方法支持正方观点，提供相应证据和推理。\n3. 识别反方观点的逻辑漏洞，并提供反驳。\n在进行分析前，请细阅以下信息：\n```\n场景描述：\n{{...}}\n正方观点：\n{{...}}\n反方观点：\n{{...}}\n支持材料：\n{{...}}\n```\n请确保分析过程中逻辑清晰、论证充分，且能够平衡理论与实际案例。",
                "EnglishPromptTemplate": "As a logic argumentation expert, please complete the following tasks:\n1. Conduct a detailed and systematic logical analysis of the provided scenario, identifying logical soundness and shortcomings.\n2. Use logical argumentation methods to support the proponent's viewpoint, providing relevant evidence and reasoning.\n3. Identify logical fallacies in the opponent's viewpoint and provide counterarguments.\nBefore proceeding with the analysis, please carefully read the following information:\n```\nScenario Description:\n{{...}}\nProponent's Viewpoint:\n{{...}}\nOpponent's Viewpoint:\n{{...}}\nSupporting Materials:\n{{...}}\n```\nEnsure that the analysis process is logically clear, thoroughly argued, and balances theory with practical examples.\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "描述关键事实、情境背景信息。",
                        "InputLabel": "场景描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入需要论证的观点。",
                        "InputLabel": "正方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入需要驳斥的观点及。",
                        "InputLabel": "反方观点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供支撑您分析的数据、案例或其他相关材料。",
                        "InputLabel": "支持材料",
                        "InputList": null
                    }
                ]
            },
            "热点分析": {
                "IsVisible": true,
                "icon": "assessment",
                "UsageDescription": "全面介绍当前热点并根据用户咨询提供专业分析。",
                "ChinesePromptTemplate": "作为一名热点分析专家，你的任务分为两部分：首先，详细介绍当前政治、经济、科技和新闻领域的热点；其次，根据用户的咨询问题提供专业分析。请按以下步骤操作：\n请仔细审阅以下信息\n当前热点：{{...}}\n用户咨询问题：{{...}}\n根据以上信息，首先对当前热点进行全面和具体的说明，然后针对用户咨询问题进行专业回答。请确保：\n- 热点介绍全面、详尽且具有时效性\n- 针对咨询问题的回答专业、准确且具有针对性\n- 完成后，请检查内容的全面性、准确性和逻辑性\n- 保持语言风格专业和适合目标读者",
                "EnglishPromptTemplate": "As a hot topic analysis expert, your task is divided into two parts: first, to provide a detailed introduction to the current hot topics in politics, economics, technology, and news; second, to offer professional analysis based on the user's consultation questions. Please follow these steps:\nCarefully review the following information\nCurrent Hot Topics: {{...}}\nUser Consultation Questions: {{...}}\nBased on the above information, first give a comprehensive and specific explanation of the current hot topics, and then provide a professional response to the user's consultation questions. Please ensure:\n- The introduction to hot topics is comprehensive, detailed, and timely\n- The response to consultation questions is professional, accurate, and targeted\n- After completion, check the comprehensiveness, accuracy, and logical consistency of the content\n- Maintain a professional language style suitable for the target audience\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入当前政治、经济、科技或新闻领域您感兴趣的热点问题（例如：重大政策发布、经济走势、科技创新、重要新闻事件等）。",
                        "InputLabel": "当前热点",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "如果您有特定咨询问题，请描述（例如：某政策背景解析、经济数据的影响评估、科技发展对行业的意义等）。",
                        "InputLabel": "咨询问题",
                        "InputList": null
                    }
                ]
            },
            "职业分析": {
                "IsVisible": true,
                "icon": "work",
                "UsageDescription": "对未来有潜力的职业或领域进行全面分析，或根据用户需求对特定职业进行深入分析。",
                "ChinesePromptTemplate": "作为专业的职业趋势分析师，你的任务是：\n1. 分析未来有潜力的职业或领域，并提供基于市场数据和行业趋势的专业全面依据。\n2. 如果用户指定某职业，根据用户需求对该职业进行深入分析。\n请根据用户提供的以下信息开始你的分析工作：\n- 职业或领域类型：{{...}}\n- 分析目的：{{...}}\n- 具体分析要求和指导：{{...}}\n确保分析报告准确、全面，并包含所有必要的分析要素。",
                "EnglishPromptTemplate": "As a professional career trend analyst, your task is to:\n1. Analyze careers or fields with future potential, providing comprehensive evidence based on market data and industry trends.\n2. If the user specifies a certain profession, conduct an in-depth analysis of that profession based on user needs.\nBegin your analysis based on the following information provided by the user:\n- Career or Field Type: {{...}}\n- Analysis Purpose: {{...}}\n- Specific Analysis Requirements and Guidelines: {{...}}\nEnsure that the analysis report is accurate, comprehensive, and includes all necessary analytical elements.\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您关注的职业或领域（例如：人工智能、可持续能源、数字营销等）。",
                        "InputLabel": "职业领域",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述您的分析目的（例如：职业发展、行业投资、教育培训等）。",
                        "InputLabel": "分析目的",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供具体、详细的分析要求和指导（例如：关键技能、行业发展趋势、薪资水平、地区差异等）。",
                        "InputLabel": "具体要求",
                        "InputList": null
                    }
                ]
            },
            "新闻分析": {
                "IsVisible": true,
                "icon": "dynamic_feed",
                "UsageDescription": "提供新闻事件分析。",
                "ChinesePromptTemplate": "作为一名专业的新闻分析师，你的任务是根据客户提供的详细信息进行专业、全面、具体的新闻事件分析服务。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n事件描述：\n{{...}}\n相关背景：\n{{...}}\n新闻价值：\n{{...}}\n反映的问题：\n{{...}}\n```\n根据以上信息，开始你的分析工作。请确保最终分析：\n- 详细且逻辑清晰地反映事件描述和背景\n- 深入挖掘并阐述新闻价值和反映的问题\n- 完成分析后，请检查并确认以下内容是否满足要求：\n  - 分析是否全面覆盖了所提供信息的方方面面\n  - 结构是否清晰，逻辑是否合理\n  - 内容是否具有深度和见解",
                "EnglishPromptTemplate": "As a professional news analyst, your task is to provide expert, comprehensive, and specific news event analysis services based on detailed information provided by the client. Please follow these steps:\nCarefully review the following information\n```\nEvent Description:\n{{...}}\nRelated Background:\n{{...}}\nNews Value:\n{{...}}\nIssues Reflected:\n{{...}}\n```\nBased on the above information, begin your analysis. Ensure that the final analysis:\n- Detailed and logically clear in reflecting the event description and background\n- Delves deep and elucidates the news value and issues reflected\n- After completing the analysis, check and confirm whether the following requirements are met:\n  - Whether the analysis comprehensively covers all aspects of the provided information\n  - Whether the structure is clear and the logic is sound\n  - Whether the content has depth and insight\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您需要分析的事件描述（例如：特定新闻事件、社会现象、政策变动等）。",
                        "InputLabel": "事件描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述与事件相关的背景信息（例如：历史沿革、相关人物、社会影响等）。",
                        "InputLabel": "相关背景",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "讨论事件的新闻价值（例如：对社会的影响、引发的讨论、潜在的变化等）。",
                        "InputLabel": "新闻价值",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "分析事件反映的问题（例如：政策缺陷、社会矛盾、法律争议等）。",
                        "InputLabel": "反映问题",
                        "InputList": null
                    }
                ]
            },
            "军事分析": {
                "IsVisible": true,
                "icon": "military_tech",
                "UsageDescription": "提供军事相关分析。",
                "ChinesePromptTemplate": "作为一名军事分析专家，你的任务是根据客户提供的详细信息进行专业、全面、具体的军事相关分析。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n军事话题：\n{{...}}\n战略或技术细节：\n{{...}}\n历史背景或当前情况：\n{{...}}\n```\n根据以上信息，开始你的分析工作。请确保最终分析：\n- 紧密围绕军事话题展开\n- 详细且逻辑清晰地反映所有的战略或技术细节\n- 涵盖相关的历史背景或当前情况\n- 完成分析后，请检查并确认以下内容是否满足要求：\n  - 分析是否全面、深入\n  - 结构是否清晰，逻辑是否合理",
                "EnglishPromptTemplate": "As a military analysis expert, your task is to provide professional, comprehensive, and specific military-related analysis based on detailed information provided by the client. Please follow these steps:\nCarefully review the following information\n```\nMilitary Topic:\n{{...}}\nStrategic or Technical Details:\n{{...}}\nHistorical Background or Current Situation:\n{{...}}\n```\nBased on the above information, begin your analysis. Ensure that the final analysis:\n- Closely revolves around the military topic\n- Detailed and logically clear in reflecting all strategic or technical details\n- Covers relevant historical background or current situation\n- After completing the analysis, check and confirm whether the following requirements are met:\n  - Whether the analysis is comprehensive and in-depth\n  - Whether the structure is clear and the logic is sound\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您要分析的军事话题（例如：特定冲突、战略发展、武器系统等）。",
                        "InputLabel": "军事话题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供所需分析的具体战略或技术问题（例如：作战策略、武器功能、技术创新等）。",
                        "InputLabel": "具体问题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述与话题相关的历史背景或当前情况（例如：历史事件、地缘政治影响、军事对峙等）。",
                        "InputLabel": "背景现状",
                        "InputList": null
                    }
                ]
            }
        },
        "医疗健康": {
            "健身": {
                "IsVisible": true,
                "icon": "fitness_center",
                "UsageDescription": "根据个人需求提供定制化的健身建议与计划。",
                "ChinesePromptTemplate": "作为一名专业的健身教练和营养顾问，你的任务是根据客户提供的详细信息制定专业、实用、个性化的健身与营养计划。请根据以下步骤操作：\n请仔细审阅以下信息\n\n健身目标：\n{{...}}\n当前健康状况和健身水平：\n{{...}}\n具体需求和限制（如饮食偏好、可用设备、时间安排等）：\n{{...}}\n\n根据以上信息，制定你的健身与营养计划。请确保最终计划：\n- 明确针对健身目标，适应当前健康状况和健身水平\n- 充分考虑具体需求和限制\n- 完成计划后，请检查并确认以下内容是否满足要求：\n  - 计划是否全面、实用\n  - 是否易于客户理解和执行\n  - 是否符合健康与安全标准",
                "EnglishPromptTemplate": "As a professional fitness coach and nutrition consultant, your task is to create a professional, practical, and personalized fitness and nutrition plan based on the detailed information provided by the client. Please follow these steps:\nCarefully review the following information\n\nFitness Goals:\n{{...}}\nCurrent Health Status and Fitness Level:\n{{...}}\nSpecific Needs and Limitations (such as dietary preferences, available equipment, time schedule, etc.):\n{{...}}\n\nBased on the above information, develop your fitness and nutrition plan. Ensure that the final plan:\n- Is clearly targeted towards the fitness goals, adapting to the current health status and fitness level\n- Fully considers specific needs and limitations\n- After completing the plan, check and confirm whether the following requirements are met:\n  - Whether the plan is comprehensive and practical\n  - Whether it is easy for the client to understand and implement\n  - Whether it conforms to health and safety standards\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "描述您的健身目标（例如：减脂、增肌、提高耐力等）。",
                        "InputLabel": "健身目标",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供您的当前健康状况和健身水平（例如：身体数据、以往经验等）。",
                        "InputLabel": "当前状况",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "阐述具体需求和限制（例如：饮食偏好、可用设备、每周可训练时间等）。",
                        "InputLabel": "需求限制",
                        "InputList": null
                    }
                ]
            },
            "营养学": {
                "IsVisible": true,
                "icon": "local_dining",
                "UsageDescription": "提供关于食物成分、饮食计划、营养摄取的专业分析。",
                "ChinesePromptTemplate": "作为一名营养学和饮食规划专家，你的任务是根据客户提供的具体信息进行专业、全面、具体、有逻辑性的食物成分分析与饮食规划指导。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n咨询问题：\n{{...}}\n食物或饮食相关信息：\n{{...}}\n特殊需求或注意事项：\n{{...}}\n```\n根据以上信息，开始你的分析或规划工作。请确保最终结果：\n- 紧密围绕客户的咨询问题和特殊需求展开\n- 详细且逻辑清晰地反映所有的信息和需求\n- 完成分析或规划后，请检查并确认以下内容是否满足要求：\n  - 是否包含所有要求的元素\n  - 分析或规划是否合理、实用\n  - 信息是否科学、准确",
                "EnglishPromptTemplate": "As an expert in nutrition and diet planning, your task is to provide professional, comprehensive, specific, and logical analysis of food components and diet planning guidance based on the specific information provided by the client. Please follow these steps:\nCarefully review the following information\n```\nConsultation Question:\n{{...}}\nFood or Diet Related Information:\n{{...}}\nSpecial Needs or Considerations:\n{{...}}\n```\nBased on the above information, begin your analysis or planning work. Ensure that the final result:\n- Closely revolves around the client's consultation question and special needs\n- Detailed and logically clear in reflecting all the information and needs\n- After completing the analysis or planning, check and confirm whether the following requirements are met:\n  - Whether it includes all required elements\n  - Whether the analysis or planning is reasonable and practical\n  - Whether the information is scientific and accurate\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的咨询问题（例如：特定食物营养成分、减肥饮食计划等）。",
                        "InputLabel": "咨询问题",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供与咨询问题相关的食物或饮食信息（例如：日常饮食习惯、特定食物等）。",
                        "InputLabel": "相关信息",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述您的特殊需求或注意事项（例如：食物过敏、健康状况等）。",
                        "InputLabel": "特殊需求",
                        "InputList": null
                    }
                ]
            },
            "心理学": {
                "IsVisible": true,
                "icon": "psychology",
                "UsageDescription": "提供心理健康、情感处理、人际关系等方面的专业咨询。",
                "ChinesePromptTemplate": "作为一名心理咨询专家，你的任务是基于专业知识和经验，针对客户的心理问题提供专业、深入、有同理心的咨询服务。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n问题描述：\n{{...}}\n背景与细节：\n{{...}}\n需求与期望：\n{{...}}\n```\n根据以上信息，开始你的咨询服务。请确保最终结果：\n- 充分理解并关注客户的心理健康问题和背景情境\n- 提供详细且逻辑清晰的分析和咨询建议\n- 完成咨询后，请检查并确认以下内容是否满足要求：\n  - 是否包含所有要求的元素\n  - 分析结构是否清晰、逻辑性是否强\n  - 咨询建议是否切实可行、符合专业标准",
                "EnglishPromptTemplate": "As a psychological consultation expert, your task is to provide professional, in-depth, and empathetic consultation services for clients' psychological issues, based on your expertise and experience. Please follow these steps:\nCarefully review the following information\n```\nProblem Description:\n{{...}}\nBackground and Details:\n{{...}}\nNeeds and Expectations:\n{{...}}\n```\nBased on the above information, begin your consultation service. Ensure that the final result:\n- Fully understands and focuses on the client's psychological health issues and background context\n- Provides detailed and logically clear analysis and consultation advice\n- After completing the consultation, check and confirm whether the following requirements are met:\n  - Whether it includes all required elements\n  - Whether the analysis structure is clear and logical\n  - Whether the consultation advice is practical and meets professional standards\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "描述您面临的心理健康问题（例如：焦虑、抑郁、人际关系困扰等）。",
                        "InputLabel": "问题描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供心理问题的相关背景与细节（例如：特定事件、情感反应、影响生活的程度等）。",
                        "InputLabel": "背景细节",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "说明您的个人需求和期望（例如：寻求应对策略、改善人际关系等）。",
                        "InputLabel": "需求期望",
                        "InputList": null
                    }
                ]
            }
        },
        "教育与社会科学": {
            "教育": {
                "IsVisible": true,
                "icon": "school",
                "UsageDescription": "针对教育方法、学习策略、教育资源提供专业建议。",
                "ChinesePromptTemplate": "作为一名教育专家，你的任务是根据提供的详细信息提供专业、具体、实用的教育方法、学习策略和教育资源建议。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n教育问题类型：\n{{...}}\n具体需求和期望：\n{{...}}\n相关背景信息：\n{{...}}\n```\n根据以上信息，开始你的建议工作。请确保最终建议：\n- 紧密围绕具体需求和期望展开\n- 结合相关背景信息，提供适宜的方法和策略\n- 完成建议后，请检查并确认以下内容是否满足要求：\n  - 建议是否切实可行、适用于特定情况\n  - 信息是否全面、逻辑性是否强\n  - 方法和策略是否创新且具有实践价值",
                "EnglishPromptTemplate": "As an education expert, your task is to provide professional, specific, and practical advice on educational methods, learning strategies, and educational resources based on the detailed information provided. Please follow these steps:\nCarefully review the following information\n```\nType of Educational Issue:\n{{...}}\nSpecific Needs and Expectations:\n{{...}}\nRelated Background Information:\n{{...}}\n```\nBased on the above information, begin your advisory work. Ensure that the final recommendation:\n- Closely revolves around the specific needs and expectations\n- Incorporates related background information to provide suitable methods and strategies\n- After completing the recommendation, check and confirm whether the following requirements are met:\n  - Whether the recommendation is practical and applicable to specific situations\n  - Whether the information is comprehensive and logical\n  - Whether the methods and strategies are innovative and have practical value\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "描述您面临的教育问题（例如：学习效率低、课堂管理困难、教材选择等）。",
                        "InputLabel": "问题类型",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "说明您的具体需求和期望（例如：提高学习效率、改善课堂互动、挑选合适教材等）。",
                        "InputLabel": "具体需求",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供与问题相关的背景信息（例如：学习环境、学生特点、已尝试的策略等）。",
                        "InputLabel": "相关背景",
                        "InputList": null
                    }
                ]
            }
        },
        "其他": {
            "购物": {
                "IsVisible": true,
                "icon": "shopping_cart",
                "UsageDescription": "提供个性化购物建议和产品比较。",
                "ChinesePromptTemplate": "作为专业的购物顾问，你的任务是根据客户提供的详细信息，提供专业、全面、具体的购物建议和产品比较。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n产品名称：\n{{...}}\n主要特点或功能：\n{{...}}\n预算范围：\n{{...}}\n品牌偏好：\n{{...}}\n```\n根据以上信息，开始你的建议工作。请确保最终建议：\n- 充分考虑产品特性、功能、预算和品牌偏好\n- 细致分析并比较不同产品的优劣\n- 完成建议后，请检查并确认以下内容是否满足要求：\n  - 建议是否适合客户需求和预算\n  - 信息是否全面\n  - 建议是否贴合客户品牌偏好和使用场景",
                "EnglishPromptTemplate": "As a professional shopping consultant, your task is to provide professional, comprehensive, and specific shopping advice and product comparisons based on the detailed information provided by the client. Please follow these steps:\nCarefully review the following information\n```\nProduct Name:\n{{...}}\nMain Features or Functions:\n{{...}}\nBudget Range:\n{{...}}\nBrand Preference:\n{{...}}\n```\nBased on the above information, begin your advisory work. Ensure that the final recommendation:\n- Fully considers product characteristics, functions, budget, and brand preferences\n- Provides a detailed analysis and comparison of the advantages and disadvantages of different products\n- After completing the recommendation, check and confirm whether the following requirements are met:\n  - Whether the recommendation suits the client's needs and budget\n  - Whether the information is comprehensive\n  - Whether the recommendation aligns with the client's brand preferences and usage scenarios\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您希望比较的产品名称（例如：智能手机、耳机、运动鞋等）。",
                        "InputLabel": "产品名称",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请描述您考虑购买的产品的主要特点或功能（例如：高性能处理器、降噪功能、运动防滑等）。",
                        "InputLabel": "特点功能",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "如果有特定预算，请提供您的预算范围（例如：500-1000元、不超过200美元等）。",
                        "InputLabel": "预算范围",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "如果有品牌偏好，请告诉我们您偏好的品牌（例如：苹果、索尼、耐克等）。",
                        "InputLabel": "品牌偏好",
                        "InputList": null
                    }
                ]
            },
            "旅行": {
                "IsVisible": true,
                "icon": "flight",
                "UsageDescription": "提供旅行相关建议。",
                "ChinesePromptTemplate": "作为一名旅行规划专家，你的任务是根据客户提供的详细信息进行专业、全面、具体的旅行计划制定和建议。请根据以下步骤操作：\n请仔细审阅以下信息\n```\n旅行目的和偏好：\n{{...}}\n目的地特点和要求：\n{{...}}\n额外需求和限制：\n{{...}}\n```\n根据以上信息，开始你的旅行规划工作。请确保最终建议：\n- 详细体现旅行目的和偏好\n- 考虑目的地的特点和要求\n- 充分考虑额外需求和限制\n- 完成规划后，请检查并确认以下内容是否满足要求：\n  - 规划是否实用、全面\n  - 是否适应旅行者的需求和兴趣\n  - 提供的信息和建议是否清晰、有帮助",
                "EnglishPromptTemplate": "As a travel planning expert, your task is to create professional, comprehensive, and specific travel plans and suggestions based on the detailed information provided by the client. Please follow these steps:\nCarefully review the following information\n```\nTravel Purpose and Preferences:\n{{...}}\nDestination Features and Requirements:\n{{...}}\nAdditional Needs and Limitations:\n{{...}}\n```\nBased on the above information, begin your travel planning work. Ensure that the final recommendation:\n- Detailedly reflects the travel purpose and preferences\n- Considers the features and requirements of the destination\n- Fully considers additional needs and limitations\n- After completing the plan, check and confirm whether the following requirements are met:\n  - Whether the plan is practical and comprehensive\n  - Whether it suits the traveler's needs and interests\n  - Whether the provided information and suggestions are clear and helpful\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请描述您的旅行目的和偏好（例如：休闲度假、探险旅行、文化体验等）。",
                        "InputLabel": "目的偏好",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "提供您考虑的目的地特点和要求（例如：气候条件、景点类型、交通便利性等）。",
                        "InputLabel": "地点要求",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述任何额外的需求和限制（例如：预算限制、时间限制、健康考虑等）。",
                        "InputLabel": "额外需求",
                        "InputList": null
                    }
                ]
            },
            "随机任务生成": {
                "IsVisible": true,
                "icon": "shuffle",
                "UsageDescription": "用于生成具有创新性和多样性的随机任务。",
                "ChinesePromptTemplate": "请生成一个随机任务。这个任务可以是任何类型，如写作、数学问题、设计挑战或者任何你能想到的任务。请先简要描述这个任务，然后给出具体的任务要求。例如，如果是写作任务，描述一下写作的主题和要求的字数；如果是数学问题，给出问题的背景和难度级别。提供信息如下：\n```\n任务类型：\n{{...}}\n任务难度：\n{{...}}\n```",
                "EnglishPromptTemplate": "Please generate a random task. This task can be of any type, such as writing, math problems, design challenges, or any other task you can think of. First, briefly describe the task, then provide specific requirements. For example, if it's a writing task, describe the theme and required word count; if it's a math problem, provide the background and difficulty level. Provide the following information:\n```\nTask Type:\n{{...}}\nTask Difficulty:\n{{...}}\n```\n(Please respond in Chinese)",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您想要的任务类型（例如：写作、数学问题、设计挑战等）。",
                        "InputLabel": "任务类型",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "描述您想要的任务难度和特定要求（例如：初级、中级、高级；特定主题或条件等）。",
                        "InputLabel": "任务难度",
                        "InputList": null
                    }
                ]
            }
        }
    },
    "分析模式": {
        "需求澄清": {
            "IsVisible": true,
            "icon": "question_answer",
            "UsageDescription": "协助用户解决因知识不足或思考不周而提出的不清晰、不全面、不切实际、自相矛盾、叙述过于复杂的任务目标（需求）。帮助用户理清思绪，使用户能够明确和细化他们的需求，并制定更专业、具体的任务目标（需求）。",
            "ChinesePromptTemplate": "作为专业的需求分析师，您的任务是基于用户提供的初始信息，按照以下步骤处理：\n```\n步骤1：多轮询问\n针对用户的需求，基于您的知识和经验进行以下审查，并使用markdown todo list格式列出存在的问题。通过与用户的多轮对话，获取必要的信息。\n- [ ] 明确性审查：确保所有需求都被详细且清楚地描述。\n- [ ] 完整性审查：检查需求文档是否完整，确保包含所有关键的功能和特性。\n- [ ] 可行性分析：对需求进行技术和经济的评估，确保它们在技术和预算上都是可行的。\n- [ ] 需求一致性：查看是否有互相冲突或矛盾的需求，并给出解决建议。\n- [ ] 简化建议：对于过于复杂的需求，给出简化或优化的建议。\n- [ ] 真实需求与表述的差异：用户所提需求是否可以有效解决他们面临的实际问题。细致考察用户提出的各项想法，是否存在不合适或非必要的功能。在识别出这类情况后，提出更为适宜的解决方案建议以供用户参考\n\n每轮对话结束后请询问用户是否结束多轮对话。如果用户确认结束或多轮对话超过5轮，进入步骤2。\n\n步骤2：需求文档生成\n基于您与用户的对话和您的审查，生成需求文档。按多层级序号格式呈现（例如1, 1.1, 1.1.1等），采用两个空格缩进。需求文档满足以下标准：\n- [ ] 明确性：每条需求都被清晰地描述，没有模糊或歧义的内容。\n- [ ] 完整性：文档全面涵盖所有关键功能和特性。\n- [ ] 可行性：所有需求都在技术和预算范围内。\n- [ ] 一致性：文档中的需求之间没有矛盾或冲突。\n- [ ] 简洁性：确保文档中的需求都是必要的，去除冗余或过于复杂的部分。\n```\n\n初始信息如下：\n```\n任务目标：\n{{...}}\n背景信息：\n{{...}}\n具体要求：\n{{...}}\n优先级和重要性：\n{{...}}\n数据和资源：\n{{...}}\n可能的挑战或问题：\n{{...}}\n预算和资源限制：\n{{...}}\n反馈和评估标准：\n{{...}}\n可能的解决方案或方向：\n{{...}}\n```",
            "EnglishPromptTemplate": "As a professional requirements analyst, your task is to process the initial information provided by the user by following these steps:\n```\nStep 1: Multiple Rounds of Inquiry\nReview the user's requirements based on your knowledge and experience and list the issues using markdown todo list format. Obtain necessary information through multiple rounds of dialogue with the user.\n- [ ] Clarity Review: Ensure all requirements are detailed and clearly described.\n- [ ] Completeness Review: Check if the requirements document is complete, covering all key functions and features.\n- [ ] Feasibility Analysis: Technically and economically evaluate the requirements to ensure they are feasible within technical and budget constraints.\n- [ ] Requirements Consistency: Check for conflicting or contradictory requirements and provide solutions.\n- [ ] Simplification Suggestions: For overly complex requirements, provide simplification or optimization suggestions.\n- [ ] Gap between Real and Stated Needs: Assess whether the user's stated requirements effectively address their actual problems. After identifying such situations, suggest more suitable solutions for the user to consider.\n\nAfter each round of dialogue, ask the user if they wish to end the multiple rounds of dialogue. If the user confirms the end or the dialogue exceeds 5 rounds, proceed to Step 2.\n\nStep 2: Requirement Document Generation\nBased on your dialogue with the user and your review, generate a requirement document. Present it in a multi-level numbering format (e.g., 1, 1.1, 1.1.1) with two spaces for indentation. The requirement document should meet the following standards:\n- [ ] Clarity: Each requirement is clearly described, with no ambiguity.\n- [ ] Completeness: The document comprehensively covers all key functions and features.\n- [ ] Feasibility: All requirements are within technical and budget limits.\n- [ ] Consistency: There are no contradictions or conflicts among requirements in the document.\n- [ ] Conciseness: Ensure the requirements in the document are necessary, removing redundant or overly complex parts.\n```\n\nInitial information is as follows:\n```\nTask Objective:\n{{...}}\nBackground Information:\n{{...}}\nSpecific Requirements:\n{{...}}\nPriority and Importance:\n{{...}}\nData and Resources:\n{{...}}\nPossible Challenges or Issues:\n{{...}}\nBudget and Resource Limitations:\n{{...}}\nFeedback and Evaluation Criteria:\n{{...}}\nPossible Solutions or Directions:\n{{...}}\n```\n(Please respond in Chinese)",
            "Inputs": [
                {
                    "InputPlaceholder": "描述具体的任务目标或期望成果。（例如：'开发具有高级数据分析功能的企业级健康追踪平台'）",
                    "InputLabel": "任务目标",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "提供项目的市场背景、目标用户群和行业竞争态势。（例如：'针对中大型企业，竞争对手主要提供基础健康追踪服务'）",
                    "InputLabel": "背景信息",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "详细说明技术规格、设计要求和项目时间表。（例如：'采用微服务架构，需符合最新的数据保护法规，六个月内发布测试版'）",
                    "InputLabel": "具体要求",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "说明项目的紧急程度和关键里程碑日期。（例如：'首次演示在第三季度，关键以满足年度产品发布计划'）",
                    "InputLabel": "优先重要",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "列举项目实施所需的关键数据集和资源。（例如：'需要访问公司内部健康数据库和云计算资源'）",
                    "InputLabel": "数据资源",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "识别可能遇到的技术难题或资源瓶颈。（例如：'数据迁移和系统集成可能面临安全性和兼容性问题'）",
                    "InputLabel": "挑战问题",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "详细描述预算范围和资源分配计划。（例如：'预算为500,000美元，包括人员成本和外部服务费用'）",
                    "InputLabel": "预算限制",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "定义项目成功的标准和评估方式。（例如：'根据用户活跃度、系统稳定性和市场占有率评估'）",
                    "InputLabel": "评估标准",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "提出项目实施的可能方案或战略方向。（例如：'考虑采用AI和机器学习技术提升数据分析能力'）",
                    "InputLabel": "解决方案",
                    "InputList": null
                }
            ]
        },
        "框架搭建": {
            "IsVisible": true,
            "icon": "architecture",
            "UsageDescription": "将需求文档分解为多层级的子任务，以实现结构化的任务管理和逐层解决。",
            "ChinesePromptTemplate": "作为任务解构专家，您的任务是通过多轮对话将复杂任务解构为多层子任务。请确保每轮对话只涵盖一个步骤，且结构过程中每个子任务具有清晰的界限和独立性，可以独立于其他任务执行。请遵循以下步骤：\n```\n步骤1：任务确认\n- 细致分析需求文档，全面、准确、逻辑清晰地阐述需要解决的任务。经用户确认（输入“1”）后，进入步骤2。\n步骤2：任务解构\n- 解构任务为子任务，要求如下：\n  - 确保每个子任务具有明确的目标、独立性和可行性。\n  - 子任务应按多层级序号格式呈现（例如1, 1.1, 1.1.1等），采用两个空格缩进。\n  - 用户需对提出的子任务结构进行审查，并选择接受或提出修改（同意则输入'1'确认，不同意则输入具体修改意见或'2'以请求新方案）。此过程持续直至获得用户的认可，然后进入步骤3。\n步骤3：细化确认\n- 询问用户是否需要对子任务进一步解构（输入序号即可，可多个）。如果不需要，输入“1”进入步骤4。如果需要，回到步骤2。\n步骤4：返回结果\n- 以代码块形式返回完整任务结构。格式要求如步骤2。\n```\n\n需求文档如下：\n---\n{{...}}\n---",
            "EnglishPromptTemplate": "As a task decomposition expert, your task is to deconstruct complex tasks into multi-layered subtasks through multiple rounds of dialogue. Ensure that each round of dialogue covers only one step, and each subtask in the decomposition process has clear boundaries and independence, capable of being executed independently of other tasks. Please follow these steps:\n```\nStep 1: Task Confirmation\n- Thoroughly analyze the requirement document, clearly, accurately, and logically outlining the tasks to be solved. After user confirmation (enter '1'), proceed to Step 2.\nStep 2: Task Decomposition\n- Decompose the task into subtasks, with the following requirements:\n  - Ensure each subtask has a clear objective, independence, and feasibility.\n  - Subtasks should be presented in a multi-level numbering format (e.g., 1, 1.1, 1.1.1) with two spaces for indentation.\n  - Users need to review the proposed subtask structure and choose to accept or suggest modifications (enter '1' to agree, enter specific modification suggestions or '2' for a new proposal). Continue this process until user approval is obtained, then proceed to Step 3.\nStep 3: Detail Confirmation\n- Ask the user if further decomposition of subtasks is needed (enter the numbers, multiple can be selected). If not needed, enter '1' to proceed to Step 4. If needed, return to Step 2.\nStep 4: Return Results\n- Return the complete task structure. The format requirements are as in Step 2.\n```\n\nRequirement document as follows:\n---\n{{...}}\n---\n(Please respond in Chinese)",
            "Inputs": [
                {
                    "InputPlaceholder": "请输入完整、详细的需求文档",
                    "InputLabel": "需求文档",
                    "InputList": null
                }
            ]
        },
        "方案设计": {
            "IsVisible": true,
            "icon": "how_to_reg",
            "UsageDescription": "基于需求文档（包含项目核心任务和相关信息）、任务清单（拆解后的层级任务）。提供对于任务清单中子任务的项目解决方案。",
            "ChinesePromptTemplate": "作为项目解决方案专家，您的任务是根据用户提供的需求文档（包含项目核心任务和相关信息）、任务清单以及用户需要解决的任务清单中的子任务。与用户进行详尽的对话。您的目标是为用户选定的子任务制定最佳解决方案。请按照以下步骤操作（###内）：\n###\n步骤1: 方案思路\n- 提出几种高效、实用的解决方案思路，并按照以下格式展示：\n  1. 方案一：\n     - 描述：[详尽阐释方案的实施思路]\n     - 优点：[具体描述]\n     - 缺点：[具体描述]\n  2. 方案二：\n     - 描述：[详尽阐释方案的实施思路]\n     - 优点：[具体描述]\n     - 缺点：[具体描述]\n  ...\n- 引导用户从所提方案中选择最适合的（通过序号选择），并邀请提出改进意见。重复此过程，直至用户满意（输入1表示进入下一步）。若无合适方案，用户可输入2以提供新思路。\n步骤2: 方案细化\n- 根据用户选择的方案，制定一套详细、清晰且易于实施的步骤。逐步骤编号，以便用户针对具体步骤提出修改意见。\n- 鼓励用户就具体步骤提出反馈，并据此调整。用户满意并输入1时，转入下一步。\n步骤3：方案总结\n- 结合步骤1的方案选择和步骤2的执行细节，提供一个综合方案，并对比分析此方案与其他选项的优劣。\n- 邀请用户就最终方案提出反馈，并根据反馈进行调整。用户满意并输入1时，整个流程结束。\n###\n提供信息如下：\n需求文档（```内）:\n```\n{{...}}\n```\n任务清单（```内）:\n```\n{{...}}\n```\n待解决子任务或子任务序号（```内）:\n```\n{{...}}\n```",
            "EnglishPromptTemplate": "As a project solution expert, your task is to develop the best solution for a subtask chosen by the user, based on the provided demand document (which includes the project's core tasks and related information), the task list, and the subtasks within this list that need resolving. Engage in a detailed dialogue with the user. Your goal is to create the optimal solution for the user's selected subtask. Please operate according to the following steps (within ###):\n###\nStep 1: Solution Concepts\n- Suggest several efficient and practical solution ideas and display them in the following format:\n  1. Solution One:\n     - Description: [Thoroughly explain the implementation approach of the solution]\n     - Advantages: [Specifically describe]\n     - Disadvantages: [Specifically describe]\n  2. Solution Two:\n     - Description: [Thoroughly explain the implementation approach of the solution]\n     - Advantages: [Specifically describe]\n     - Disadvantages: [Specifically describe]\n  ...\n- Guide the user to select the most suitable solution from those proposed (by number), inviting suggestions for improvement. Repeat this process until the user is satisfied (enter 1 to move to the next step). If no suitable solution exists, the user can enter 2 to provide new ideas.\nStep 2: Solution Refinement\n- Based on the user's chosen solution, develop a set of detailed, clear, and easily implementable steps. Number each step so the user can provide specific modification suggestions.\n- Encourage the user to give feedback on specific steps and adjust accordingly. When the user is satisfied and enters 1, proceed to the next step.\nStep 3: Solution Summary\n- Combine the chosen solution from Step 1 with the execution details from Step 2 to offer a comprehensive solution, and analyze the strengths and weaknesses of this solution compared to other options.\n- Invite the user to provide feedback on the final solution and adjust based on this feedback. The process ends when the user is satisfied and enters 1.\n###\nProvide the following information:\nDemand Document (within ```):\n```\n{{...}}\n```\nTask List (within ```):\n```\n{{...}}\n```\nSubtasks to be resolved or subtask number (within ```):\n```\n{{...}}\n``` (Please respond in Chinese)",
            "Inputs": [
                {
                    "InputPlaceholder": "请输入完整、详细的需求文档",
                    "InputLabel": "需求文档",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "请输入任务清单",
                    "InputLabel": "任务清单",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "请输入需要解决的子任务（可输入序号）",
                    "InputLabel": "任务序号",
                    "InputList": null
                }
            ]
        },
        "文档撰写": {
            "IsVisible": true,
            "icon": "text_snippet",
            "UsageDescription": "基于需求文档、任务清单、子任务解决方案及概述撰写与子任务相关的文档。",
            "ChinesePromptTemplate": "根据需求文档、任务清单以及子任务解决方案，撰写与指定子任务相关的文档。请确保文档：1. 重点描述子任务相关信息，适当参考需求文档和任务清单，避免与需求文档或任务清单出现明显冲突；2. 专业、明确、结构清晰、逻辑性强；3. 充分反映子任务的详细信息。提供信息如下：\n```\n需求文档:\n{{...}}\n任务清单:\n{{...}}\n子任务解决方案:\n{{...}}\n子任务解决方案概述:\n{{...}}\n```",
            "EnglishPromptTemplate": "Based on the requirement document, task list, and subtask solution, write a document related to the specified subtask. Ensure that the document: 1. Emphasizes information related to the subtask, appropriately referencing the requirement document and task list, while avoiding obvious conflicts with them; 2. Is professional, clear, well-structured, and logical; 3. Fully reflects the detailed information of the subtask. Provide the following information:\n```\nRequirement Document:\n{{...}}\nTask List:\n{{...}}\nSubtask Solution:\n{{...}}\nSubtask Solution Overview:\n{{...}}\n```\n(Please respond in Chinese)",
            "Inputs": [
                {
                    "InputPlaceholder": "请输入需求文档。",
                    "InputLabel": "需求文档",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "请输入任务清单。",
                    "InputLabel": "任务清单",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "请输入子任务解决方案。",
                    "InputLabel": "解决方案",
                    "InputList": null
                },
                {
                    "InputPlaceholder": "请输入子任务解决方案概述。",
                    "InputLabel": "方案概述",
                    "InputList": null
                }
            ]
        }
    },
    "流程模式": {
        "编程【仅测试】": {
            "思路分析【仅测试】": {
                "IsVisible": true,
                "icon": "1-square-fill",
                "UsageDescription": "程序（算法）整体方案设计【仅测试】",
                "ChinesePromptTemplate": "我希望你担任算法专家。为给定任务提出所有常用的实现方法和简介（深度学习方法优先），并详细比较速度和效果差异。用中文回复。给定任务如下：\n任务描述：\n{{...}}\n入参：\n{{...}}\n出参：\n{{...}}\n\n",
                "EnglishPromptTemplate": "I would like you to act as an algorithm expert. For a given task, propose all common implementation methods and a brief introduction (prioritizing deep learning methods), and compare their speed and effectiveness in detail. Please respond in Chinese. The given task is as follows:\nTask Description:\n{{...}}\nInput Parameters:\n{{...}}\nOutput Parameters:\n{{...}}\n\n",
                "Inputs": [
                    {
                        "InputPlaceholder": "请输入您的任务目标。",
                        "InputLabel": "任务目标",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入您的入参描述。",
                        "InputLabel": "入参描述",
                        "InputList": null
                    },
                    {
                        "InputPlaceholder": "请输入您的出参描述。",
                        "InputLabel": "出参描述",
                        "InputList": null
                    }
                ]
            },
            "xxx【仅测试】": {
                "IsVisible": true,
                "icon": "2-square-fill",
                "UsageDescription": "程序（算法）整体方案设计【仅测试】",
                "ChinesePromptTemplate": "",
                "EnglishPromptTemplate": "",
                "Inputs": []
            },
            "xxxx【仅测试】": {
                "IsVisible": true,
                "icon": "3-square-fill",
                "UsageDescription": "程序（算法）整体方案设计【仅测试】",
                "ChinesePromptTemplate": "",
                "EnglishPromptTemplate": "",
                "Inputs": []
            }
        }
    },
    "探索模式": {},
    "自定义模式":{
        "自定义模版":{
                "UsageDescription": "xxx",
                "ChinesePromptTemplate": "xxx",
                "EnglishPromptTemplate": "xxx",
                "Inputs": [],
                "icon": "dashboard_customize"
        }
    }
}