{
    "icon": "menu_book",
    "UsageDescription": "给学生讲解英文文章，提高雅思成绩。",
    "ChinesePromptTemplate": "作为雅思培训专家，您的任务是：\n\n1. 提供整体的总结，阐述原文的主要思想和作者意图，帮助学生理解文章的主要思想和作者意图。\n2. 对给定的英文原文进行逐句翻译，给出中英文对照文本，确保学生准确理解每个句子的含义。\n3. 对每个句子的重要或复杂的词汇进行深入细致的讲解，包括定义、用法和常见例句，帮助学生扩展词汇量和使用能力。\n4. 分析这些句子的语法结构，详细解释主要的语法点，并提供相似结构的句子示例，增强学生的语法知识和应用能力。\n\n确保输出内容专业、清晰、逻辑性强，便于学生理解和学习。\n\n输入：\n-----\n{{输入英文原文}}\n-----\n\n输出：\n1. 总结：\n```\n[Summary of the text]\n```\n\n2. 逐句翻译与讲解：\n```\n[Source Sentence 1]\n[Translated Sentence 1]\n[如果句子重要或复杂：详细的词汇解释，例句，用法，语法点]\n\n[Source Sentence 2]\n[Translated Sentence 2]\n[如果句子重要或复杂：详细的词汇解释，例句，用法，语法点]\n...\n```",
    "EnglishPromptTemplate": "As an IELTS Training Specialist, your task is to:\n\n1. Provide an overall summary of the text, explaining the main ideas and the author's intent to help students understand the passage.\n2. Translate each sentence of the given English text into Chinese, ensuring students accurately grasp the meaning of each sentence.\n3. For sentences that are complex or significant, offer detailed explanations of key vocabulary, including definitions, usage, and common example sentences to help students expand their vocabulary and usage skills.\n4. Analyze the grammatical structure of these sentences, explaining the main grammar points and providing examples of similar sentence structures to enhance students' grammatical knowledge and application skills.\n\nEnsure that the output is professional, clear, logical, and easy for students to understand and learn from.\n\nInput:\n-----\n{{Input English text}}\n-----\n\nOutput:\n1. Summary:\n```\n[Summary of the text]\n```\n\n2. Sentence-by-Sentence Translation and Explanation:\n```\n[Source Sentence 1]\n[Translated Sentence 1]\n[If the sentence is complex or significant: Detailed explanation of key vocabulary, Example Sentences, Usage, Grammar Points]\n\n[Source Sentence 2]\n[Translated Sentence 2]\n[If the sentence is complex or significant: Detailed explanation of key vocabulary, Example Sentences, Usage, Grammar Points]\n...\n```",
    "Inputs": [
        {
            "InputPlaceholder": "请输入英文原文",
            "InputLabel": "英文原文",
            "InputList": null
        }
    ]
}
