{
    "icon": "draw",
    "UsageDescription": "根据用户指定的风格调整给定文本的表述。保持原文的语言和方言不变。",
    "ChinesePromptTemplate": "在不改变语言的情况下，您的任务是根据指定风格重写三引号间的文本。所需风格为：{{...}}。确保输出与文本的语言种类或方言相同，换句话说，不要改变语言，并且只给我输出，不要包括其他内容。不要用引号包裹回应。\n    \"\"\"\n    {{...}}\n    \"\"\"",
    "EnglishPromptTemplate": "Without changing the language, your task is to rewrite the text delimited by triple quotes according to the specified style. The required style is: {{...}}. Ensure output in the same language variety or dialect of the text - in other words don't change the language, and only give me the output and nothing else. Do not wrap responses in quotes.\n    \"\"\"\n    {{...}}\n    \"\"\"",
    "Inputs": [
        {
            "InputPlaceholder": "请输入您希望的文章风格（例如：学术、随意、幽默）。",
            "InputLabel": "文章风格",
            "InputList": [
                "学术风格。文风应严肃、严谨、朴实且准确。结构清晰合理，推理符合逻辑；语言应规范、简练、朴素，避免夸张或庸俗表达，确保概念和术语的明确性和准确性；表达方式应遵循语法和表达习惯。无拼写、句法或语法错误",
                "书面风格。通常要求语言表达严谨、规范，用词要准确无误。句子结构应清晰合理，语法正确。这种风格常用于正式文件、学术论文等，要求避免口语化表达和俚语。",
                "口语风格。更加随意、口头化，常用于日常对话和非正式场合。句子可能更短，允许俚语和口头习惯用语，语法规则可能更宽松。",
                "商业风格。要求语言清晰、简洁，用于商业信函、营销材料等。通常注重传达信息和吸引受众，避免过多的技术术语，但仍需专业性。",
                "技术风格。要求准确性和清晰性，通常用于科学、工程、技术领域的文档和报告。语言应避免模糊不清或多义的表达，术语使用准确，结构清晰。",
                "社交媒体风格。风格通常更加轻松、随意，适用于社交媒体平台如Twitter、Facebook等。句子可能较短，包含表情符号和缩写词，用词更接近口语。",
                "文学风格。强调文学性和艺术性，通常用于文学作品如小说、诗歌等。语言可以更富有想象力，表达更加丰富，允许修辞和象征的使用。",
                "幽默风格。注重制造笑声和娱乐性，通常包括滑稽的表达、笑话和夸张的修辞手法。",
                "简洁风格。追求简洁明了的表达，尽量避免冗长的句子和繁琐的词汇，力求简练和易懂。",
                "质朴风格。强调朴素、自然和质朴的语言表达，通常用于描述大自然、乡村生活等情景。",
                "晦涩风格。语言表达复杂而难以理解，通常使用晦涩的词汇、句法结构或引用隐晦的象征。这种风格可能需要读者或听众具备高度的文化和语言背景知识才能理解。",
                "马尔克斯-魔幻现实主义风格。通常描绘现实与超自然元素的交织，其语言风格融合了奇幻、不寻常和超现实元素，创造出令人着迷的效果。语言丰富而细腻，常常带有超现实的色彩。细腻的笔触不仅增强了故事的真实感，即使在描述最不可思议的情节时也是如此。现实世界与神话、梦境等元素相互渗透，构建出一个充满象征意义和隐喻的世界，从而揭示深邃的哲理性。"
            ]
        },
        {
            "InputPlaceholder": "请输入您需要按照指定风格修改的文本。",
            "InputLabel": "原始文本",
            "InputList": null
        }
    ]
}